
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>01-概述与三个基本观念 · 记录</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Xintao">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-emphasize/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-shades-of-purple.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-flexible-alerts/style.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-click-reveal/click_reveal.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-theme-coolx/theme.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../styles/website.css">
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="02-朴素的总结.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="header-inner">
        <!-- LOGO -->
        <div class="logo">
            <!--<img src="" alt="logo">-->
            <!-- use background instead of logo to avoid image path problem -->
        </div>
        <span class="title"></span>

        <!-- Search -->
        
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>


        <!-- Nav -->
        <ul class="header-nav">
            <li>
                <a href="https://xinntao.github.io/" target="_blank">
                    <b></p>Home (host on github)</b>
                </a>
            </li><li>
                <a href="https://xinntao.gitee.io/" target="_blank">
                    <b></p>Home (host on gitee)</b>
                </a>
            </li><li>
                <a href="https://github.com/xinntao/records" target="_blank">
                    <b></p>GitHub</b>
                </a>
            </li><li>
                <a href="https://gitee.com/xinntao/records" target="_blank">
                    <b></p>Gitee码云</b>
                </a>
            </li>
        </ul>
    </div>

    <div class="book-summary">
        <!--<div class="book-summary-title">文档目录</div>-->
        
        
        <nav role="navigation">
            


<ul class="summary">
    
    
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../工具软件使用/">
            
                <a href="../工具软件使用/">
            
                    
                    工具软件使用
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../工具软件使用/Ubuntu配置PyTorch环境.html">
            
                <a href="../工具软件使用/Ubuntu配置PyTorch环境.html">
            
                    
                    Ubuntu配置PyTorch环境
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../工具软件使用/zsh配置.html">
            
                <a href="../工具软件使用/zsh配置.html">
            
                    
                    zsh配置
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../工具软件使用/tmux使用.html">
            
                <a href="../工具软件使用/tmux使用.html">
            
                    
                    tmux使用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="../工具软件使用/vscode配置.html">
            
                <a href="../工具软件使用/vscode配置.html">
            
                    
                    vscode配置
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="../工具软件使用/git配置.html">
            
                <a href="../工具软件使用/git配置.html">
            
                    
                    git配置
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="../工具软件使用/git使用.html">
            
                <a href="../工具软件使用/git使用.html">
            
                    
                    git使用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="../工具软件使用/Latex安装.html">
            
                <a href="../工具软件使用/Latex安装.html">
            
                    
                    Latex安装
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="../工具软件使用/gitbook使用.html">
            
                <a href="../工具软件使用/gitbook使用.html">
            
                    
                    gitbook使用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.9" data-path="../工具软件使用/Ubuntu安装MATLAB.html">
            
                <a href="../工具软件使用/Ubuntu安装MATLAB.html">
            
                    
                    Ubuntu安装MATLAB
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="./">
            
                <a href="./">
            
                    
                    流程规范与经验
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.3.1" data-path="01-概述与三个基本观念.html">
            
                <a href="01-概述与三个基本观念.html">
            
                    
                    01-概述与三个基本观念
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="02-朴素的总结.html">
            
                <a href="02-朴素的总结.html">
            
                    
                    02-朴素的总结
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="03-开发流程.html">
            
                <a href="03-开发流程.html">
            
                    
                    03-开发流程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="10-文献格式与管理.html">
            
                <a href="10-文献格式与管理.html">
            
                    
                    10-文献格式与管理
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


        </nav>
        
        
    </div>

    <!-- Content nav -->
    <div class="book-anchor" , id="my-book-anchor">
        <!--<div class="book-anchor-title">在这篇文章中:</div>-->
        <div class="book-anchor-body">
        </div>
    </div>

    <div class="book-body">
        
        <div class="body-inner" , id="main-body-inner">
            
            

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >01-概述与三个基本观念</a>
    </h1>
</div>




            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner" , id="my-page-inner">
                    
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                    <section class="normal markdown-section">
                        
                        <h1 id="01-&#x6982;&#x8FF0;&#x4E0E;&#x4E09;&#x4E2A;&#x57FA;&#x672C;&#x89C2;&#x5FF5;">01 &#x6982;&#x8FF0;&#x4E0E;&#x4E09;&#x4E2A;&#x57FA;&#x672C;&#x89C2;&#x5FF5;</h1>
<h2 id=""><!-- toc --></h2>
<p>&#x8FD9;&#x4E2A;&#x7CFB;&#x5217;&#x4E3B;&#x8981;&#x7528;&#x6765;&#x603B;&#x7ED3;&#x81EA;&#x5DF1;&#x8BFB; PhD &#x671F;&#x95F4;&#x7684;&#x4E00;&#x4E9B;&#x7ECF;&#x9A8C;&#x3002;&#x53BB;&#x5E74;&#x6BD5;&#x4E1A;&#x4E4B;&#x65F6;&#x5C31;&#x6709;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#xFF0C;&#x4F46;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x5199;&#x4E0B;&#x6765;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x987E;&#x8651;&#xFF1A;&#x4E00;&#x662F;&#x8BF4;&#x51FA;&#x6765;&#x4E86;&#x611F;&#x89C9;&#x50CF;&#x9E21;&#x6C64;&#xFF0C;&#x6709;&#x70B9;&#x98DF;&#x4E4B;&#x65E0;&#x5473;&#x5F03;&#x4E4B;&#x53EF;&#x60DC;&#x7684;&#x611F;&#x89C9;&#xFF1B;&#x4E8C;&#x662F;&#x603B;&#x7ED3;&#x53EA;&#x662F;&#x57FA;&#x4E8E;&#x4E2A;&#x4EBA;&#x7B80;&#x5355;&#x7684;&#x611F;&#x609F;&#xFF0C;&#x6015;&#x6709;&#x8BEF;&#x5BFC;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6BD5;&#x4E1A;&#x4E00;&#x5E74;&#x591A;&#x4E86;&#xFF0C;&#x5FC3;&#x6001;&#x5E73;&#x548C;&#x4E86;&#xFF0C;&#x8138;&#x76AE;&#x4E5F;&#x539A;&#x4E86;&#xFF0C;&#x89C9;&#x5F97;&#x53EF;&#x4EE5;&#x5C0F;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x53CD;&#x601D;&#x8FC7;&#x53BB;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x81EA;&#x5DF1;&#x4E5F;&#x53EF;&#x4EE5;&#x57FA;&#x4E8E;&#x6B64;&#x53BB;&#x6539;&#x8FDB;&#x63D0;&#x9AD8;&#x3002;&#x6211;&#x60F3;&#x5BF9;&#x5927;&#x5BB6;&#x5E94;&#x8BE5;&#x4F1A;&#x6709;&#x4E9B;&#x5E2E;&#x52A9;&#xFF0C;&#x81F3;&#x5C11;&#x589E;&#x52A0;&#x4E86;&#x4E00;&#x4E2A;&#x6837;&#x672C;&#x70B9;&#x3002;</p>
<hr>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x89C9;&#x5F97;&#x4F1A;&#x6709;&#x4E9B;&#x5E2E;&#x52A9;&#x5462;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5BF9;&#x521A;&#x8FDB;&#x5165;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x4EB2;&#x8EAB;&#x4F53;&#x9A8C;&#x3002;&#x6211;&#x521A;&#x5F00;&#x59CB;&#x8BFB; PhD &#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B8C;&#x5168;&#x662F;&#x4E00;&#x9897;&#x5C0F;&#x767D;&#x83DC;&#xFF0C;&#x5F53;&#x65F6;&#x6709;&#x5F88;&#x957F;&#x7684;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5728;&#x539F;&#x5730;&#x6253;&#x8F6C;&#xFF0C;&#x5F88;&#x591A;&#x4E0D;&#x5408;&#x7406;&#x7684;&#x60F3;&#x6CD5;&#x3001;&#x505A;&#x6CD5;&#x5E26;&#x6765;&#x4E86;&#x8D1F;&#x9762;&#x5F71;&#x54CD;&#x3002;&#x751A;&#x81F3;&#x66FE;&#x591A;&#x6B21;&#x6000;&#x7591;&#x81EA;&#x5DF1;&#x662F;&#x5426;&#x9002;&#x5408;&#x8BFB;&#x535A;&#xFF0C;&#x662F;&#x5426;&#x80FD;&#x591F;&#x987A;&#x5229;&#x6BD5;&#x4E1A;&#x3002;&#x8981;&#x662F;&#x73B0;&#x5728;&#x7684;&#x6211;&#x53BB;&#x544A;&#x8BC9;&#x521A;&#x5165;&#x5B66;&#x7684;&#x6211;&#xFF0C;&#x90A3;&#x4E00;&#x5B9A;&#x53EF;&#x4EE5;&#x5C11;&#x8D70;&#x5F88;&#x591A;&#x5F2F;&#x8DEF;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8D70;&#x5F97;&#x66F4;&#x6709;&#x4FE1;&#x5FC3;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#xFF0C; &#x5F53;&#x65F6;&#x7684;&#x6211;&#xFF0C;&#x60F3;&#x6CD5;&#x8DF3;&#x5F97;&#x5F88;&#x5FEB;&#xFF0C;&#x7A81;&#x7136;&#x8FF8;&#x51FA;&#x6765;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#xFF0C;&#x5C31;&#x53BB;&#x5C1D;&#x8BD5;&#x4E86;&#xFF1B;&#x8BD5;&#x4E86;&#x7ED3;&#x679C;&#x4E0D;&#x597D;&#xFF0C;&#x5C31;&#x653E;&#x5F03;&#x4E86;&#xFF0C;&#x5C31;&#x8F6C;&#x800C;&#x5BFB;&#x627E;&#x4E0B;&#x4E00;&#x4E2A;&#x201C;&#x673A;&#x4F1A;&#x201D;&#x3002;&#x90A3;&#x6211;&#x73B0;&#x5728;&#x5C31;&#x89C9;&#x5F97;&#x8FD9;&#x662F;&#x201C;&#x8D4C;&#x5F92;&#x5FC3;&#x6001;&#x201D;&#xFF0C;&#x4EE5;&#x8D4C;&#x5F92;&#x5FC3;&#x6001;&#x505A;&#x4E8B;&#xFF0C;&#x90A3;&#x5C31;&#x548C;&#x8D4C;&#x5F92;&#x4E00;&#x6837;&#xFF0C;&#x8D4C;&#x5230;&#x6700;&#x540E;&#x4E00;&#x65E0;&#x6240;&#x6709;&#x4E86;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5F53;&#x65F6;&#x7684;&#x6211;&#xFF0C;&#x8DD1;&#x5B9E;&#x9A8C;&#x6CA1;&#x6709;&#x7AE0;&#x6CD5;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x60F3;&#x6CD5;&#x5C31;&#x76F4;&#x63A5;&#x8BD5;&#xFF0C;&#x600E;&#x4E48;&#x7BA1;&#x7406;&#x4EE3;&#x7801;&#x5462;&#xFF1F;&#x4E5F;&#x4E0D;&#x4F7F;&#x7528;git&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x5B9E;&#x9A8C;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5939;&#x3002;&#x8FD9;&#x662F;&#x843D;&#x540E;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x539F;&#x59CB;&#x793E;&#x4F1A;&#x4E00;&#x6837;&#x3002;&#x4E0D;&#x4E00;&#x800C;&#x8DB3;&#x3002;</p>
<p>&#x6211;&#x63D0;&#x8FD9;&#x4E9B;&#x6211;&#x81EA;&#x8EAB;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x662F;&#x60F3;&#x8BF4;&#x660E;&#xFF1A;</p>
<ol>
<li>&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x4E0D;&#x77E5;&#x9053;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x90A3;&#x4E48;&#x7ED9;&#x4E88;&#x4E00;&#x4E2A;&#x201C;&#x79CD;&#x5B50;&#x201D;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x5E2E;&#x52A9;&#xFF1B;</li>
<li>&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x7684;&#xFF0C;&#x73B0;&#x5728;&#x505A;&#x5F97;&#x4E0D;&#x597D;&#xFF0C;&#x505A;&#x5F97;&#x6DF7;&#x4E71;&#x6CA1;&#x6709;&#x7AE0;&#x6CD5;&#xFF0C;&#x4F46;&#x53EA;&#x8981;&#x52AA;&#x529B;&#x53BB;&#x6539;&#x53D8;&#xFF0C;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;&#x540E;&#xFF0C;&#x5C31;&#x4E00;&#x5B9A;&#x4F1A;&#x6709;&#x63D0;&#x5347;&#x3002;</li>
</ol>
<p>&#x8BF4;&#x5230;&#x8FD9;&#x91CC;&#xFF0C; &#x6211;&#x5FC5;&#x987B;&#x8981;&#x8868;&#x8FBE;&#x6211;&#x5BF9;&#x6211;&#x7684;&#x5BFC;&#x5E08; Chen Change Loy (&#x5415;&#x5065;&#x52E4;)&#x8001;&#x5E08;&#x3001;&#x8463;&#x8D85;&#x5E08;&#x5144;&#x8FD8;&#x6709; MMLab &#x540C;&#x5B66;&#x7684;&#x611F;&#x8C22;&#x3002;&#x5728;&#x4E0D;&#x987A;&#x5229;&#x7684;&#x9636;&#x6BB5;&#xFF0C;&#x8010;&#x5FC3;&#x6307;&#x5BFC;&#xFF0C;&#x79EF;&#x6781;&#x9F13;&#x52B1;&#xFF0C;&#x8FD8;&#x6709;&#x5927;&#x5BB6;&#x7684;&#x4E92;&#x76F8;&#x4EA4;&#x6D41;&#xFF0C;&#x8FD9;&#x4E9B;&#x662F;&#x6700;&#x73CD;&#x8D35;&#x96BE;&#x5F97;&#x7684;&#x3002;</p>
<hr>
<p>&#x5728;&#x8C08;&#x5177;&#x4F53;&#x7684;&#x4E4B;&#x524D;&#xFF0C; &#x6211;&#x5148;&#x804A;&#x804A;&#x4E09;&#x4E2A;&#x57FA;&#x672C;&#x89C2;&#x5FF5;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x5B83;&#x4EEC;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x51E0;&#x4E2A;&#x70B9;&#xFF0C;&#x6709;&#x4E86;&#x5B83;&#x4EEC;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x5C31;&#x53EF;&#x4EE5;&#x9010;&#x6E10;&#x751F;&#x53D1;&#x51FA;&#x6765;&#x3002;</p>
<h2 id="&#x4E00;&#x3001;&#x53A8;&#x5E08;&#x6700;&#x91CD;&#x8981;&#x7684;&#x54C1;&#x8D28;">&#x4E00;&#x3001;&#x53A8;&#x5E08;&#x6700;&#x91CD;&#x8981;&#x7684;&#x54C1;&#x8D28;</h2>
<p>&#x7B2C;&#x4E00;&#x70B9;&#x662F;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x8981;&#x505A;&#x4E00;&#x4E2A;&#x597D;&#x53A8;&#x5E08;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x60F3;&#x60F3;&#x3002;</p>
<p>&#x6709;&#x4EBA;&#x8BF4;&#x5200;&#x5DE5;&#x53A8;&#x827A;&#x57FA;&#x672C;&#x529F;&#x8981;&#x597D;&#xFF1B;&#x6216;&#x8005;&#x6709;&#x597D;&#x5E08;&#x5085;&#x5E26;&#xFF1B;&#x6216;&#x8981;&#x6709;&#x8FDB;&#x53D6;&#x5FC3;&#xFF1B;&#x6216;&#x8981;&#x52E4;&#x594B;&#x7EC3;&#x4E60;&#xFF0C;&#x6301;&#x4E4B;&#x4EE5;&#x6052;&#x2026;&#x2026;&#x6211;&#x89C9;&#x5F97;&#x554A;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x662F;&#x4F1A;&#x5403;&#x3002;&#x4ED6;&#x80FD;&#x591F;&#x5403;&#x51FA;&#x4E00;&#x4E2A;&#x83DC;&#x597D;&#x5403;&#x4E0E;&#x5426;&#xFF0C;&#x597D;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x5DEE;&#x5728;&#x54EA;&#x91CC;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x53A8;&#x5E08;&#xFF0C;&#x81EA;&#x5DF1;&#x505A;&#x51FA;&#x4E86;&#x83DC;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x548C;&#x5927;&#x53A8;&#x7684;&#x5DEE;&#x8DDD;&#xFF0C;&#x90A3;&#x4ED6;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x671D;&#x4EC0;&#x4E48;&#x65B9;&#x5411;&#x6539;&#x8FDB;&#xFF0C;&#x603B;&#x4E0D;&#x80FD;&#x90FD;&#x9760;&#x7740;&#x8001;&#x5E08;&#x5085;&#x6765;&#x6559;&#x5427;&#xFF0C;&#x800C;&#x4E14;&#x518D;&#x600E;&#x4E48;&#x6559;&#xFF0C;&#x4E5F;&#x5F88;&#x96BE;&#x4F53;&#x609F;&#x5230;&#x8001;&#x5E08;&#x5085;&#x505A;&#x83DC;&#x7684;&#x90A3;&#x79CD;&#x611F;&#x89C9;&#x3002;&#x6240;&#x4EE5;&#x5462;&#xFF0C;&#x80FD;&#x591F;&#x770B;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x95EE;&#x9898;&#x6240;&#x5728;&#xFF0C;&#x77E5;&#x9053;&#x548C;&#x522B;&#x4EBA;&#x7684;&#x5DEE;&#x8DDD;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x8FD9;&#x662F;&#x8FDB;&#x6B65;&#x7684;&#x524D;&#x63D0;&#xFF0C;&#x4E5F;&#x6700;&#x4E3A;&#x5173;&#x952E;&#x4E86;&#x3002;&#x53EA;&#x8981;&#x77E5;&#x9053;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x6709;&#x529E;&#x6CD5;&#x53BB;&#x89E3;&#x51B3;&#xFF0C;&#x53BB;&#x63D0;&#x5347;&#xFF0C;&#x53BB;&#x8FDB;&#x6B65;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#x5462;&#xFF0C;&#x8001;&#x5E08;&#x5E08;&#x5144;&#x7684;&#x51E0;&#x53E5;&#x8BDD;&#xFF0C;&#x5B9E;&#x9A8C;&#x5BA4;&#x540C;&#x5B66;&#x4EEC;&#x7684;&#x4EA4;&#x6D41;&#xFF0C;&#x5F80;&#x5F80;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x5207;&#x5165;&#x70B9;&#x3002;&#x6211;&#x4EEC;&#x4E60;&#x4EE5;&#x4E3A;&#x5E38;&#x7684;&#x4E8B;&#xFF0C;&#x5E73;&#x65F6;&#x662F;&#x5F88;&#x96BE;&#x89C9;&#x5BDF;&#x5230;&#x5DEE;&#x8DDD;&#xFF0C;&#x8FDB;&#x800C;&#x53BB;&#x6539;&#x53D8;&#x3002;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x5951;&#x673A;&#x8BA9;&#x81EA;&#x5DF1;&#x611F;&#x53D7;&#x5230;&#x95EE;&#x9898;&#x6240;&#x5728;&#xFF0C;&#x5DEE;&#x8DDD;&#x6240;&#x5728;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x6587;&#x7AE0;&#x6709;&#x6F5C;&#x5728;&#x5E2E;&#x52A9;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x5219;&#x8981;&#x57F9;&#x517B;&#x8FD9;&#x79CD;&#x201C;&#x5403;&#x51FA;&#x5DEE;&#x5F02;&#x201D;&#x7684;&#x81EA;&#x7701;&#x80FD;&#x529B;&#xFF0C;&#x953B;&#x70BC;&#x51FA;&#x654F;&#x611F;&#x6027;&#xFF0C;&#x80FD;&#x591F;&#x6293;&#x4F4F;&#x5DEE;&#x8DDD;&#x7684;&#x5173;&#x952E;&#x3002;</p>
<h2 id="&#x4E8C;&#x3001;&#x8981;&#x6709;&#x8FED;&#x4EE3;&#x7684;&#x60F3;&#x6CD5;">&#x4E8C;&#x3001;&#x8981;&#x6709;&#x8FED;&#x4EE3;&#x7684;&#x60F3;&#x6CD5;</h2>
<p>&#x5927;&#x90E8;&#x5206;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x505A;&#x4E8B;&#x90FD;&#x4E0D;&#x662F;&#x4E00;&#x8E74;&#x800C;&#x5C31;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x6B65;&#x6B65;&#x63D0;&#x5347;&#x7684;&#x3002;&#x8FED;&#x4EE3;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x80CC;&#x540E;&#x5305;&#x542B;&#x7740;&#x51E0;&#x5C42;&#x610F;&#x601D;&#xFF1A;</p>
<ol>
<li>&#x6211;&#x4EEC;&#x6709;&#x65F6;&#x5019;&#x6709;&#x5B8C;&#x7F8E;&#x4E3B;&#x4E49;&#xFF0C;&#x6709;&#x4E0D;&#x5B8C;&#x7F8E;&#x7684;&#x5730;&#x65B9;&#x5C31;&#x4E0D;&#x60F3;&#x8FDB;&#x884C;&#x4E0B;&#x4E00;&#x6B65;&#xFF0C;&#x751A;&#x81F3;&#x4E0D;&#x53BB;&#x505A;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x88AB;&#x56F0;&#x5728;&#x539F;&#x5730;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5148;&#x6709;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x51FA;&#x6765;&#xFF0C;&#x4E0D;&#x5B8C;&#x7F8E;&#x4E0D;&#x8981;&#x7D27;&#xFF0C;&#x540E;&#x9762;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x63D0;&#x5347;&#x561B;&#x3002;</li>
<li>&#x5982;&#x679C;&#x62B1;&#x7740;&#x8FED;&#x4EE3;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x4FBF;&#x63A5;&#x53D7;&#x4E86;&#x73B0;&#x5728;&#x7684;&#x4E0D;&#x8DB3;&#xFF0C;&#x63A5;&#x53D7;&#x4E0D;&#x8DB3;&#xFF0C;&#x53D1;&#x73B0;&#x5DEE;&#x8DDD;&#xFF0C;&#x662F;&#x540E;&#x9762;&#x8FDB;&#x6B65;&#x7684;&#x8D77;&#x70B9;&#x3002;&#x5148;&#x6293;&#x4F4F;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#x89E3;&#x51B3;&#xFF0C;&#x5728;&#x8FED;&#x4EE3;&#x4E2D;&#x80FD;&#x66F4;&#x65E9;&#x5730;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x5E76;&#x89E3;&#x51B3;&#xFF0C;&#x66F4;&#x65E9;&#x66F4;&#x7075;&#x6D3B;&#x5730;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#x3002;</li>
<li>&#x6709;&#x4E86;&#x8FED;&#x4EE3;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x62B1;&#x7740;&#x201C;&#x8BD5;&#x4E00;&#x628A;&#x201D;&#x7684;&#x5FC3;&#x6001;&#xFF0C;&#x662F;&#x5728;&#x8E0F;&#x5B9E;&#x505A;&#x4E8B;&#xFF0C;&#x5FC3;&#x91CC;&#x4E0D;&#x865A;&#xFF0C;&#x5BF9;&#x540E;&#x9762;&#x7684;&#x53D1;&#x5C55;&#x4E5F;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x6709;&#x4FE1;&#x5FC3;&#x3002;</li>
<li>&#x76F8;&#x53CD;&#x5730;&#xFF0C;&#x4E0D;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x60F3;&#x7740;&#x4E00;&#x8E74;&#x800C;&#x5C31;&#xFF0C;&#x4E00;&#x53D1;&#x5373;&#x4E2D;&#xFF0C;&#x90A3;&#x4FBF;&#x662F;&#x8D4C;&#x5F92;&#x5FC3;&#x6001;&#x4E86;&#x3002;&#x4E00;&#x65E6;&#x6709;&#x8D4C;&#x5F92;&#x5FC3;&#x6001;&#x4E86;&#xFF0C;&#x5F88;&#x591A;&#x7EC6;&#x8282;&#x4E5F;&#x5C31;&#x4E0D;&#x5173;&#x6CE8;&#x4E86;&#xFF0C;&#x53EA;&#x60F3;&#x7740;&#x4E2D;&#x5F69;&#x7968;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x5B9E;&#x73B0;&#x4E0A;&#x7684;&#x95EE;&#x9898;&#x5462;&#xFF0C;&#x8FD8;&#x662F;&#x60F3;&#x6CD5;&#x672C;&#x8EAB;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x957F;&#x671F;&#x4EE5;&#x5F80;&#xFF0C;&#x5C31;&#x6253;&#x51FB;&#x81EA;&#x4FE1;&#x5FC3;&#x4E86;&#x3002;</li>
</ol>
<h2 id="&#x4E09;&#x3001;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;">&#x4E09;&#x3001;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;</h2>
<p>&#x4E0D;&#x77E5;&#x9053;&#x5927;&#x5BB6;&#x6709;&#x6CA1;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x611F;&#x53D7;&#xFF1A;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#x662F;&#x8001;&#x5E08;&#x7ED9;&#x7684;&#xFF0C;&#x8BD5;&#x4E86;&#x4E00;&#x4E0B;&#x6216;&#x8005;&#x51E0;&#x4E0B;&#xFF0C;&#x4E0D;work&#xFF0C;&#x5FC3;&#x91CC;&#x4FBF;&#x4F1A;&#x72AF;&#x5600;&#x5495;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x8001;&#x5E08;&#x7684;&#x60F3;&#x6CD5;&#x6709;&#x95EE;&#x9898;&#x554A;&#xFF0C;&#x4FBF;&#x5F52;&#x56E0;&#x5230;&#x5916;&#x90E8;&#x53BB;&#x4E86;&#x3002;&#x76F8;&#x53CD;&#x5730;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x82B1;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x601D;&#x8003;&#x5F97;&#x5230;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x4E0D;work&#x4E86;&#xFF0C;&#x4E5F;&#x4F1A;&#x6709;&#x4E00;&#x80A1;&#x5B50;&#x729F;&#x52B2;&#xFF0C;&#x201C;&#x600E;&#x4E48;&#x4F1A;&#x4E0D;work&#x5462;&#xFF1F;&#x662F;&#x4E0D;&#x662F;&#x54EA;&#x91CC;&#x5B9E;&#x73B0;&#x6709;&#x95EE;&#x9898;&#x554A;&#x201D;&#x3002;&#x201C;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x6211;&#x60F3;&#x4E86;&#x90A3;&#x4E48;&#x4E45;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x5408;&#x7406;&#xFF0C;&#x600E;&#x4E48;&#x5C31;&#x4E0D;work&#x5462;&#xFF1F;&#x201D;</p>
<p>&#x8FD9;&#x4FBF;&#x662F;&#x95EE;&#x9898;&#x7684;&#x5173;&#x952E;&#x3002;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x505A;&#x51FA;&#x6765;&#xFF0C;&#x505A;&#x4E0D;&#x51FA;&#x6765;&#xFF0C;&#x5C31;&#x5728;&#x4E00;&#x5FF5;&#x4E4B;&#x95F4;&#x3002;&#x518D;&#x591A;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;&#x518D;&#x591A;&#x505A;&#x4E00;&#x70B9;&#xFF0C;&#x53EF;&#x80FD;&#x5C31;&#x5E26;&#x6765;&#x5F88;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x7ED3;&#x679C;&#x4E86;&#x3002;&#x56E0;&#x6B64;&#x5462;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x628A;&#x60F3;&#x6CD5;&#x5F53;&#x4F5C;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x8981;&#x628A;&#x4E8B;&#x60C5;&#x5F53;&#x505A;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x3002;&#x800C;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5B83;&#x4EEC;&#x4E5F;&#x7684;&#x786E;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x4E5F;&#x7684;&#x786E;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x3002;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x4E0D;&#x6CE8;&#x610F;&#xFF0C;&#x56E0;&#x4E3A;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x662F;&#x53D1;&#x751F;&#x5728;&#x6F5C;&#x610F;&#x8BC6;&#x91CC;&#x9762;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x4FBF;&#x8981;&#x683C;&#x5916;&#x6CE8;&#x610F;&#xFF0C;&#x9700;&#x8981;&#x7684;&#x65F6;&#x5019;&#x8981;&#x53CD;&#x89C2;&#x81EA;&#x5DF1;&#x7684;&#x6F5C;&#x610F;&#x8BC6;&#x4E86;&#x3002;</p>
<p>&#x989D;&#x5916;&#x8BF4;&#x4E00;&#x53E5;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x9AD8;&#x660E;&#x7684;&#x8001;&#x5E08;&#x6216;&#x8005;&#x6307;&#x5BFC;&#xFF0C;&#x5C31;&#x662F;&#x8981;&#x901A;&#x8FC7;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x628A;&#x6307;&#x5BFC;&#x8F6C;&#x53D8;&#x6210;&#x8BA9;&#x5B66;&#x751F;&#x4EE5;&#x4E3A;&#x662F;&#x81EA;&#x5DF1;&#x53D1;&#x73B0;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x4E3A;&#x662F;&#x81EA;&#x5DF1;&#x6709;&#x4E86;&#x60F3;&#x6CD5;&#xFF0C;&#x4EE5;&#x4E3A;&#x662F;&#x81EA;&#x5DF1;&#x5F97;&#x5230;&#x4E86;&#x63D0;&#x5347;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x6559;&#x5BFC;&#x662F;&#x6700;&#x9AD8;&#x660E;&#x7684;&#x3002;</p>
<hr>
<p>&#x4EE5;&#x4E0A;&#x4FBF;&#x662F;&#x6211;&#x89C9;&#x5F97;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4E09;&#x4E2A;&#x57FA;&#x672C;&#x89C2;&#x5FF5;&#xFF0C;&#x5982;&#x679C;&#x8FD8;&#x6709;&#x7684;&#x8BDD;&#xFF0C;&#x53EF;&#x80FD;&#x5C31;&#x8FD8;&#x6709;&#x534A;&#x4E2A;&#x89C2;&#x5FF5;&#x2014;&#x2014;&#x8981;&#x6709;&#x5E73;&#x5E38;&#x5FC3;&#xFF0C;&#x4E0D;&#x504F;&#x6267;&#x3002;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x786E;&#x5B9E;&#x4ED8;&#x51FA;&#x4E86;&#x52AA;&#x529B;&#xFF0C;&#x4F46;&#x662F;&#x5916;&#x5728;&#x7684;&#x6240;&#x5F97;&#xFF0C;&#x5728;&#x548C;&#x522B;&#x4EBA;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x89C9;&#x5F97;&#x591A;&#x4E86;&#x6216;&#x8005;&#x5C11;&#x4E86;&#xFF0C;&#x5FC3;&#x91CC;&#x4E0D;&#x5E73;&#x8861;&#x4E86;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x4E8B;&#x5F88;&#x6B63;&#x5E38;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x7684;&#x56E0;&#x7D20;&#x5F71;&#x54CD;&#x7740;&#x4E8B;&#x7269;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x4E0D;&#x6B62;&#x662F;&#x4E2A;&#x4EBA;&#x7684;&#x52AA;&#x529B;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x5E73;&#x5E38;&#x5FC3;&#x5BF9;&#x5F85;&#xFF0C;&#x201C;&#x504F;&#x8981;&#x4EC0;&#x4E48;&#x4EC0;&#x4E48;&#x201D;&#xFF0C;&#x201C;&#x504F;&#x5F97;&#x600E;&#x6837;&#x600E;&#x6837;&#x201D;&#xFF0C;&#x4FBF;&#x4F1A;&#x504F;&#x6267;&#x3002;&#x4E00;&#x65E6;&#x504F;&#x6267;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x8282;&#x594F;&#x4F1A;&#x4E71;&#x4E86;&#xFF0C;&#x60F3;&#x6CD5;&#x505A;&#x6CD5;&#x4FBF;&#x4F1A;&#x6DF7;&#x4E71;&#xFF0C;&#x8D4C;&#x5F92;&#x5FC3;&#x6001;&#x4FBF;&#x4F1A;&#x6ECB;&#x751F;&#xFF0C;&#x53CD;&#x800C;&#x5F71;&#x54CD;&#x81EA;&#x5DF1;&#xFF0C;&#x4E0D;&#x81EA;&#x5728;&#x3002;&#x7279;&#x522B;&#x662F;&#x6700;&#x8FD1;&#x5404;&#x79CD;&#x8D44;&#x8BAF;&#x90FD;&#x5728;&#x8D29;&#x5356;&#x7126;&#x8651;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x66F4;&#x9700;&#x8981;&#x5E73;&#x5E38;&#x5FC3;&#xFF0C;&#x6709;&#x5B9A;&#x529B;&#x3002;</p>
<p>&#x63A5;&#x7740;&#xFF0C;&#x6211;&#x4EEC;&#x56DE;&#x5230;&#x7CFB;&#x5217;&#x7684;&#x9898;&#x76EE;&#x3010;&#x6D41;&#x7A0B;&#x89C4;&#x8303;&#x4E0E;&#x7ECF;&#x9A8C;&#x3011;&#x3002;&#x6211;&#x4EEC;&#x8C08;&#x4E00;&#x4E0B;&#x76EE;&#x7684;&#x3002;&#x76EE;&#x7684;&#x7528;&#x4E0B;&#x9762;&#x4E00;&#x5F20;PPT&#x5C31;&#x53EF;&#x4EE5;&#x8BF4;&#x660E;&#x5566;&#xFF0C;&#x5C31;&#x4E0D;&#x5177;&#x4F53;&#x89E3;&#x91CA;&#x4E86;&#x3002;</p>
<!-- ![01-目的](imgs/01-目的.png) -->
<center><img src="imgs/01-&#x76EE;&#x7684;.png" alt="01-&#x76EE;&#x7684;" width="600"></center>

<p>&#x6700;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x7CFB;&#x5217;&#x5927;&#x6982;&#x4F1A;&#x6309;&#x7167;&#x4E0B;&#x9762;&#x7684;&#x63D0;&#x7EB2;&#x6765;&#x5199;&#xFF1A;</p>
<ol>
<li>&#x6734;&#x7D20;&#x7684;&#x603B;&#x7ED3;</li>
<li>&#x5F00;&#x53D1;&#x6D41;&#x7A0B;</li>
<li>&#x5F00;&#x53D1;&#x73AF;&#x5883;</li>
<li>&#x4EE3;&#x7801;&#x89C4;&#x8303;</li>
<li>&#x4EE3;&#x7801;&#x7BA1;&#x7406;</li>
<li>&#x9879;&#x76EE;&#xFF08;&#x5B9E;&#x9A8C;&#xFF09;&#x7BA1;&#x7406;</li>
<li>&#x6C47;&#x62A5;&#x8BA8;&#x8BBA;</li>
<li>&#x5F00;&#x6E90;&#x5171;&#x4EAB;</li>
</ol>
<p>&#x5E0C;&#x671B;&#x5BF9;&#x5927;&#x5BB6;&#x6709;&#x6240;&#x5E2E;&#x52A9; :-)</p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; Xintao all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x4FEE;&#x6539;&#x65F6;&#x95F4;: 
2021-10-30 11:30:08
</span></footer>
                        
                    </section>
                    
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                </div>
            </div>
            
        </div>

        
        
        <a href="./"
            class="navigation navigation-prev "
            aria-label="Previous page: 流程规范与经验">
            <i class="fa fa-angle-left"></i>
        </a>
        
        
        <a href="02-朴素的总结.html"
            class="navigation navigation-next "
            aria-label="Next page: 02-朴素的总结">
            <i class="fa fa-angle-right"></i>
        </a>
        
        
        
    </div>
    <script>
        var gitbook = gitbook || [];
        gitbook.push(function () {
            gitbook.page.hasChanged({"page":{"title":"01-概述与三个基本观念","level":"1.3.1","depth":2,"next":{"title":"02-朴素的总结","level":"1.3.2","depth":2,"path":"流程规范与经验/02-朴素的总结.md","ref":"流程规范与经验/02-朴素的总结.md","articles":[]},"previous":{"title":"流程规范与经验","level":"1.3","depth":1,"path":"流程规范与经验/README.md","ref":"流程规范与经验/README.md","articles":[{"title":"01-概述与三个基本观念","level":"1.3.1","depth":2,"path":"流程规范与经验/01-概述与三个基本观念.md","ref":"流程规范与经验/01-概述与三个基本观念.md","articles":[]},{"title":"02-朴素的总结","level":"1.3.2","depth":2,"path":"流程规范与经验/02-朴素的总结.md","ref":"流程规范与经验/02-朴素的总结.md","articles":[]},{"title":"03-开发流程","level":"1.3.3","depth":2,"path":"流程规范与经验/03-开发流程.md","ref":"流程规范与经验/03-开发流程.md","articles":[]},{"title":"10-文献格式与管理","level":"1.3.4","depth":2,"path":"流程规范与经验/10-文献格式与管理.md","ref":"流程规范与经验/10-文献格式与管理.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["theme-coolx@git+https://github.com/xinntao/gitbook-plugin-theme-coolx","-sharing","-lunr","-search","-highlight","expandable-chapters","chapter-fold","tbfed-pagefooter","search-plus","katex","emphasize","prism","todo","editlink","flexible-alerts","click-reveal@git+https://github.com/xinntao/gitbook-plugin-click-reveal"],"ignores":["node_modules","_book"],"root":".","styles":{"website":"styles/website.css","ebook":"styles/website.css","pdf":"styles/website.css","mobi":"styles/website.css","epub":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy Xintao","modify_label":"修改时间: ","modify_format":"YYYY-MM-DD HH:mm:ss"},"chapter-fold":{},"prism":{"css":["gitbook-plugin-theme-coolx/_themes/prism-shades-of-purple.css"]},"emphasize":{},"editlink":{"label":"Edit This Page","multilingual":false,"base":"https://github.com/xinntao/records/blob/master/"},"todo":{},"theme-coolx":{"copyButtons":true,"copyLines":true,"dragSplitter":true,"favicon":"favicon.png","logo":"logo.png","search-placeholder":"输入关键字搜索","hide-elements":[".summary .gitbook-link"]},"katex":{},"fontsettings":{"theme":"white","family":"sans","size":2},"click-reveal":{},"flexible-alerts":{"danger":{"className":"danger","icon":"fa fa-ban","label":"Attention"},"note":{"className":"info","icon":"fa fa-info-circle","label":"Note"},"style":"flat","tip":{"className":"tip","icon":"fa fa-lightbulb-o","label":"Tip"},"warning":{"className":"warning","icon":"fa fa-exclamation-triangle","label":"Warning"},"comment":{"label":"Comment","icon":"fa fa-comments","className":"info"}},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"expandable-chapters":{},"search-plus":{}},"theme":"default","author":"Xintao","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"themeCoolX":{"nav":[{"url":"https://xinntao.github.io/","target":"_blank","name":"Home (host on github)"},{"url":"https://xinntao.gitee.io/","target":"_blank","name":"Home (host on gitee)"},{"url":"https://github.com/xinntao/records","target":"_blank","name":"GitHub"},{"url":"https://gitee.com/xinntao/records","target":"_blank","name":"Gitee码云"}]}},"title":"记录","language":"zh-hans","links":{"sidebar":{}},"gitbook":"3.2.3","description":"记录"},"file":{"path":"流程规范与经验/01-概述与三个基本观念.md","mtime":"2021-10-30T03:30:08.416Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-11-22T14:23:57.268Z"},"basePath":"..","book":{"language":""}})
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-flexible-alerts/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-click-reveal/click_reveal.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-theme-coolx/theme.js"></script>
        
    

    </body>
</html>

