
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>02-朴素的总结 · 记录</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Xintao">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-emphasize/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-shades-of-purple.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-flexible-alerts/style.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-click-reveal/click_reveal.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-theme-coolx/theme.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../styles/website.css">
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="03-开发流程.html" />
    
    
    <link rel="prev" href="01-概述与三个基本观念.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="header-inner">
        <!-- LOGO -->
        <div class="logo">
            <!--<img src="" alt="logo">-->
            <!-- use background instead of logo to avoid image path problem -->
        </div>
        <span class="title"></span>

        <!-- Search -->
        
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>


        <!-- Nav -->
        <ul class="header-nav">
            <li>
                <a href="https://xinntao.github.io/" target="_blank">
                    <b></p>Home (host on github)</b>
                </a>
            </li><li>
                <a href="https://xinntao.gitee.io/" target="_blank">
                    <b></p>Home (host on gitee)</b>
                </a>
            </li><li>
                <a href="https://github.com/xinntao/records" target="_blank">
                    <b></p>GitHub</b>
                </a>
            </li><li>
                <a href="https://gitee.com/xinntao/records" target="_blank">
                    <b></p>Gitee码云</b>
                </a>
            </li>
        </ul>
    </div>

    <div class="book-summary">
        <!--<div class="book-summary-title">文档目录</div>-->
        
        
        <nav role="navigation">
            


<ul class="summary">
    
    
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../工具软件使用/">
            
                <a href="../工具软件使用/">
            
                    
                    工具软件使用
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../工具软件使用/Ubuntu配置PyTorch环境.html">
            
                <a href="../工具软件使用/Ubuntu配置PyTorch环境.html">
            
                    
                    Ubuntu配置PyTorch环境
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../工具软件使用/zsh配置.html">
            
                <a href="../工具软件使用/zsh配置.html">
            
                    
                    zsh配置
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../工具软件使用/tmux使用.html">
            
                <a href="../工具软件使用/tmux使用.html">
            
                    
                    tmux使用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="../工具软件使用/vscode配置.html">
            
                <a href="../工具软件使用/vscode配置.html">
            
                    
                    vscode配置
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="../工具软件使用/git配置.html">
            
                <a href="../工具软件使用/git配置.html">
            
                    
                    git配置
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="../工具软件使用/git使用.html">
            
                <a href="../工具软件使用/git使用.html">
            
                    
                    git使用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="../工具软件使用/Latex安装.html">
            
                <a href="../工具软件使用/Latex安装.html">
            
                    
                    Latex安装
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="../工具软件使用/gitbook使用.html">
            
                <a href="../工具软件使用/gitbook使用.html">
            
                    
                    gitbook使用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.9" data-path="../工具软件使用/Ubuntu安装MATLAB.html">
            
                <a href="../工具软件使用/Ubuntu安装MATLAB.html">
            
                    
                    Ubuntu安装MATLAB
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="./">
            
                <a href="./">
            
                    
                    流程规范与经验
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="01-概述与三个基本观念.html">
            
                <a href="01-概述与三个基本观念.html">
            
                    
                    01-概述与三个基本观念
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.2" data-path="02-朴素的总结.html">
            
                <a href="02-朴素的总结.html">
            
                    
                    02-朴素的总结
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="03-开发流程.html">
            
                <a href="03-开发流程.html">
            
                    
                    03-开发流程
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


        </nav>
        
        
    </div>

    <!-- Content nav -->
    <div class="book-anchor" , id="my-book-anchor">
        <!--<div class="book-anchor-title">在这篇文章中:</div>-->
        <div class="book-anchor-body">
        </div>
    </div>

    <div class="book-body">
        
        <div class="body-inner" , id="main-body-inner">
            
            

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >02-朴素的总结</a>
    </h1>
</div>




            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner" , id="my-page-inner">
                    
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                    <section class="normal markdown-section">
                        
                        <h1 id="02-&#x6734;&#x7D20;&#x7684;&#x603B;&#x7ED3;">02 &#x6734;&#x7D20;&#x7684;&#x603B;&#x7ED3;</h1>
<h2 id=""><!-- toc --></h2>
<p>&#x9996;&#x5148;&#xFF0C;&#x6765;&#x8C08;&#x8C08;&#x4E00;&#x4E9B;&#x6734;&#x7D20;&#x7684;&#x603B;&#x7ED3;&#x3002;&#x201C;&#x6734;&#x7D20;&#x201D;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF1A;&#x8FD9;&#x4E9B;&#x662F;&#x81EA;&#x5DF1;&#x5728;&#x65E5;&#x5E38;&#x4E2D;&#x81EA;&#x53D1;&#x603B;&#x7ED3;&#x7684;&#xFF0C;&#x8FD8;&#x6CA1;&#x6709;&#x7ECF;&#x8FC7;&#x7CFB;&#x7EDF;&#x5316;&#x3001;&#x7406;&#x8BBA;&#x5316;&#x7684;&#x601D;&#x8003;&#xFF0C;&#x8FD8;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x6210;&#x4F53;&#x7CFB;&#x7684;&#x7ECF;&#x9A8C;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x603B;&#x7ED3;&#x4F1A;&#x6709;&#x4E9B;&#x7410;&#x788E;&#xFF0C;&#x6211;&#x4E00;&#x70B9;&#x70B9;&#x8BF4;&#x660E;&#x3002;&#x8FD9;&#x4E9B;&#x603B;&#x7ED3;&#x66F4;&#x591A;&#x63CF;&#x8FF0;&#x7684;&#x662F;&#x601D;&#x60F3;&#x6027;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x662F;&#x8981;&#x62D8;&#x6CE5;&#x4E8E;&#x6240;&#x63CF;&#x8FF0;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x800C;&#x662F;&#x8981;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x610F;&#x8BC6;&#x53BB;&#x770B;&#x5F85;&#x6211;&#x4EEC;&#x5E73;&#x65F6;&#x7684;&#x72B6;&#x6001;&#x3002;&#x6211;&#x81EA;&#x5DF1;&#x662F;&#x53D7;&#x76CA;&#x4E8E;&#x8FD9;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x603B;&#x7ED3;&#x7684;&#x3002;</p>
<h2 id="&#x8981;&#x591A;&#x60F3;&#xFF0C;&#x8FD9;&#x5408;&#x7406;&#x5417;&#xFF1F;&#x8FD9;&#x4E0D;&#x5408;&#x7406;">&#x201C;&#x8981;&#x591A;&#x60F3;&#x201D;&#xFF0C;&#x201C;&#x8FD9;&#x5408;&#x7406;&#x5417;&#xFF1F;&#x8FD9;&#x4E0D;&#x5408;&#x7406;&#x201D;</h2>
<p>&#x8FD9;&#x662F;&#x5F15;&#x7528;&#x7684;&#x4E24;&#x53E5;&#x8BDD;&#xFF0C;&#x6211;&#x4F1A;&#x7ECF;&#x5E38;&#x8BB0;&#x8D77;&#x6765;&#xFF1A;</p>
<ol>
<li><p>&#x201C;&#x8981;&#x591A;&#x60F3;&#x201D;&#xFF1A;&#x662F;&#x300A;&#x4E09;&#x4F53;&#x300B;&#x4E2D;&#x7AE0;&#x5317;&#x6D77;&#x7684;&#x7236;&#x4EB2;&#x4E0E;&#x7AE0;&#x5317;&#x6D77;&#x7684;&#x91CD;&#x8981;&#x5BF9;&#x8BDD;&#x3002;</p>
<blockquote>
<p>&#x7236;&#x4EB2;&#xFF1A;&#x8981;&#x591A;&#x60F3;&#x3002;</p>
<p>&#x7AE0;&#x5317;&#x6D77;&#xFF1A;&#x60F3;&#x4E86;&#x4EE5;&#x540E;&#x5462;&#xFF1F;</p>
<p>&#x7236;&#x4EB2;&#xFF1A;&#x5317;&#x6D77;&#xFF0C;&#x6211;&#x53EA;&#x80FD;&#x544A;&#x8BC9;&#x4F60;&#x5728;&#x90A3;&#x4EE5;&#x524D;&#x8981;&#x591A;&#x60F3;&#x3002;</p>
</blockquote>
<p> &#x6211;&#x662F;&#x501F;&#x7528;&#x7AE0;&#x5317;&#x6D77;&#x7236;&#x4EB2;&#x7684;&#x8BDD;&#xFF0C;&#x60F3;&#x8868;&#x8FBE;&#x201C;&#x8981;&#x591A;&#x60F3;&#x201D;&#x672C;&#x8EAB;&#x7684;&#x8FD9;&#x4E2A;&#x542B;&#x4E49;&#x3002;&#x65E0;&#x8BBA;&#x662F;&#x7814;&#x7A76;&#x4E0A;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x8FD8;&#x662F;&#x5B9E;&#x9A8C;&#x7684;&#x8BBE;&#x8BA1;&#x4E0E;&#x5206;&#x6790;&#x3002;&#x6211;&#x4EEC;&#x90FD;&#x8981;&#x591A;&#x60F3;&#xFF0C;&#x60F3;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x6BD4;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x6709;&#x6CA1;&#x6709; &#x6CA1;&#x6709;&#x8003;&#x8651;&#x5230;&#x7684;&#x70B9;</li>
<li>&#x6709;&#x6CA1;&#x6709; &#x66F4;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x662F;&#x5426;&#x662F;&#x5FC5;&#x987B;&#x7684;</li>
<li><p>&#x8BE5;&#x5982;&#x4F55;&#x53D6;&#x820D;</p>
<p>&#x60F3;&#x6E05;&#x695A;&#x4E86;&#x3001;&#x60F3;&#x5168;&#x9762;&#x4E86;&#xFF0C;&#x518D;&#x52A8;&#x624B;&#xFF0C;&#x5F80;&#x5F80;&#x4F1A;&#x4E8B;&#x534A;&#x529F;&#x500D;&#xFF0C;&#x6240;&#x8C13;&#x78E8;&#x5200;&#x4E0D;&#x8BEF;&#x780D;&#x67F4;&#x5DE5;&#x3002;</p>
</li>
</ul>
</li>
<li><p>&#x201C;&#x8FD9;&#x5408;&#x7406;&#x5417;&#xFF1F;&#x8FD9;&#x4E0D;&#x5408;&#x7406;&#x201D;&#xFF1A;&#x8FD9;&#x662F;&#x4E00;&#x53E5;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x6897;&#xFF0C;&#x6BD4;&#x8F83;&#x597D;&#x5730;&#x4F20;&#x8FBE;&#x4E86;&#x9700;&#x8981;&#x4E0D;&#x65AD;&#x53CD;&#x601D;&#x81EA;&#x5DF1;&#x3001;&#x53CD;&#x601D;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#x7684;&#x610F;&#x601D;&#x3002;</p>
<p> &#x6211;&#x4EEC;&#x8981;&#x65F6;&#x523B;&#x57FA;&#x4E8E;&#x7ECF;&#x9A8C;&#xFF0C;&#x57FA;&#x4E8E;&#x5E38;&#x8BC6;&#x5224;&#x65AD;&#xFF0C;&#x591A;&#x53CD;&#x95EE;&#x81EA;&#x5DF1;&#x4E00;&#x53E5;&#x201C;&#x8FD9;&#x5408;&#x7406;&#x5417;&#xFF1F;&#x201D;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;</p>
<ul>
<li>&#x4E0D;&#x5408;&#x7406; &#x610F;&#x5473;&#x7740; bug &#x6216;&#x8005; &#x65B0;&#x53D1;&#x73B0;&#xFF1B;&#x6BD4;&#x5982;&#x5B9E;&#x9A8C;&#x7ED3;&#x679C;&#x4E0E;&#x5206;&#x6790;&#x7684;&#x4E0D;&#x5408;&#x7406;</li>
<li>&#x4E0D;&#x5408;&#x7406; &#x610F;&#x5473;&#x7740; &#x9700;&#x8981;&#x6539;&#x53D8;&#xFF1A;&#x6BD4;&#x5982;&#x6709;&#x4E9B;&#x4EE3;&#x7801;&#x3001;&#x6D41;&#x7A0B;&#x592A;&#x9EBB;&#x70E6;&#xFF0C;&#x8981;&#x601D;&#x8003;&#x66F4;&#x4F18;&#x7684;&#x4EE3;&#x7801;&#x3001;&#x6D41;&#x7A0B;&#xFF0C;&#x63D0;&#x9AD8;&#x6548;&#x7387;</li>
</ul>
</li>
</ol>
<p>&#x8FD9;&#x6837;&#x591A;&#x601D;&#x8003;&#x548C;&#x591A;&#x53CD;&#x601D;&#xFF0C;&#x662F;&#x53EF;&#x4EE5;&#x953B;&#x70BC;&#x7684;&#xFF0C;&#x4EE5;&#x8FBE;&#x5230;&#x6F5C;&#x610F;&#x8BC6;&#x5C31;&#x53EF;&#x4EE5;&#x505A;&#x7684;&#x5730;&#x6B65;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4FDD;&#x6301;&#x8DB3;&#x591F;&#x7684;&#x654F;&#x611F;&#xFF0C;&#x770B;&#x5230;&#x4E0D;&#x5408;&#x7406;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4E0D;&#x80FD;&#x65E0;&#x52A8;&#x4E8E;&#x8877;&#x3002;</p>
<h2 id="&#x8981;&#x53EF;&#x5927;&#x53EF;&#x5C0F;">&#x8981;&#x53EF;&#x5927;&#x53EF;&#x5C0F;</h2>
<p>&#x505A;&#x7814;&#x7A76;&#x3001;&#x5199;paper&#x8981;&#x5173;&#x6CE8;&#x7684;&#x4E1C;&#x897F;&#x662F;&#x975E;&#x5E38;&#x591A;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x80FD;&#x529B;&#xFF0C;&#x80FD;&#x591F;&#x201C;&#x53EF;&#x5927;&#x53EF;&#x5C0F;&#x201D;&#x5730;&#x6765;&#x770B;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5C3A;&#x5EA6;&#x4E0A;&#x770B;&#x95EE;&#x9898;&#x3002;</p>
<h4 id="&#x5927;&#x8981;&#x6293;&#x4F4F;&#x5B8F;&#x89C2;">&#x5927;&#x8981;&#x6293;&#x4F4F;&#x5B8F;&#x89C2;</h4>
<p>&#x4E00;&#x4E2A;&#x7814;&#x7A76;&#x9879;&#x76EE;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x628A;&#x63E1;&#x4F4F;&#x5927;&#x7684;&#x5B8F;&#x89C2;&#x65B9;&#x9762;&#xFF0C;&#x6BD4;&#x5982;</p>
<ul>
<li>&#x9879;&#x76EE;&#x6574;&#x4F53;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x6846;&#x67B6;&#xFF0C;&#x65B9;&#x6848;</li>
<li>&#x7814;&#x7A76;(paper)&#x7684;&#x8D21;&#x732E;&#xFF1B;paper&#x7684;&#x5E03;&#x5C40;&#xFF1B;&#x7814;&#x7A76;&#x9879;&#x76EE;&#x6574;&#x4F53;&#x5B89;&#x6392;</li>
<li>&#x505A;&#x5B9E;&#x9A8C;&#x7684; RoadMap&#xFF0C;&#x6392;&#x671F;</li>
</ul>
<p>&#x867D;&#x7136;&#x5728;&#x7814;&#x7A76;&#x8FDB;&#x884C;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F1A;&#x6709;&#x65B0;&#x7684;&#x53D8;&#x6570;&#xFF0C;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x4E0D;&#x65AD;&#x6839;&#x636E;&#x60C5;&#x51B5;&#x5B9E;&#x65F6;&#x8C03;&#x6574;&#xFF0C;&#x4F46;&#x8FD9;&#x4E0D;&#x59A8;&#x788D;&#x6211;&#x4EEC;&#x4E0D;&#x65AD;&#x5730;&#x53BB;&#x6293;&#x5B8F;&#x89C2;&#x3002;&#x5E76;&#x4E14;&#xFF0C;&#x5F80;&#x5F80;&#x8FD9;&#x4E9B;&#x5B8F;&#x89C2;&#x65B9;&#x9762;&#x5E94;&#x8BE5;&#x8981;&#x7A33;&#x5B9A;&#x53D1;&#x5C55;&#xFF0C;&#x5B8F;&#x89C2;&#x53D8;&#x5F97;&#x592A;&#x5FEB;&#xFF0C;&#x4E5F;&#x662F;&#x4E0D;&#x5408;&#x7406;&#x7684;&#x3002;</p>
<p>&#x6293;&#x4F4F;&#x5B8F;&#x89C2;&#xFF0C;&#x6211;&#x4EEC;&#x540C;&#x65F6;&#x8981;&#x6CE8;&#x610F;&#x5230;&#xFF1A;</p>
<ul>
<li>&#x8981;&#x6293;&#x4E3B;&#x8981;&#x77DB;&#x76FE;&#xFF0C;&#x4E0D;&#x80FD;&#x62D8;&#x6CE5;&#x7EC6;&#x8282;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x53EF;&#x6709;&#x53EF;&#x65E0;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x5426;&#x5219;&#x4F1A;&#x843D;&#x5165;&#x201C;&#x7EC6;&#x8282;&#x7684;&#x9ED1;&#x6D1E;&#x201D;</li>
<li>&#x9632;&#x6B62;&#x94BB;&#x6B7B;&#x80E1;&#x540C;&#xFF0C;&#x8D8A;&#x8D70;&#x8D8A;&#x504F;</li>
</ul>
<p>&#x6389;&#x5165;&#x7EC6;&#x8282;&#x7684;&#x9ED1;&#x6D1E;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x4E0D;&#x65AD;&#x53D1;&#x6563;&#x3002;&#x6211;&#x4EEC;&#x672A;&#x77E5;&#x7684;&#x4E1C;&#x897F;&#x662F;&#x65E0;&#x7A77;&#x65E0;&#x5C3D;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x6837;&#x53D1;&#x6563;&#x4E0B;&#x53BB;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x6536;&#x655B;&#x51FA;&#x9636;&#x6BB5;&#x6027;&#x7684;&#x7ED3;&#x679C;&#x6765;&#x4E86;&#x3002;&#x5E76;&#x4E14;&#xFF0C;&#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x7EC6;&#x8282;&#x90FD;&#x5F53;&#x6210;&#x4E86;&#x91CD;&#x70B9;&#xFF0C;&#x90A3;&#x53CD;&#x800C;&#x662F;&#x6CA1;&#x6709;&#x91CD;&#x70B9;&#x4E86;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x57F9;&#x517B;&#x80FD;&#x529B;&#xFF1A;&#x80FD;&#x591F;&#x6293;&#x4F4F;&#x4E3B;&#x8981;&#x77DB;&#x76FE;&#xFF0C;&#x7740;&#x91CD;&#x5173;&#x6CE8;&#x4ED6;&#x4EEC;&#x3002;&#x8BDD;&#x53C8;&#x8BF4;&#x56DE;&#x6765;&#xFF0C;&#x4E0A;&#x9762;&#x8BF4;&#x7684;&#x8FD9;&#x4E9B;&#x53C8;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x8BEF;&#x89E3;&#xFF0C;&#x8BEF;&#x89E3;&#x4E3A;&#x4E0D;&#x9700;&#x8981;&#x5173;&#x6CE8;&#x7EC6;&#x8282;&#x3002;&#x4E0D;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x8981;&#x5173;&#x6CE8;&#x7EC6;&#x8282;&#xFF0C;&#x4F46;&#x53C8;&#x4E0D;&#x80FD;&#x62D8;&#x6CE5;&#x4E8E;&#x7EC6;&#x8282;&#x3002;&#x73B0;&#x5728;&#x7684;&#x5F88;&#x591A;&#x4EE3;&#x7801;&#x3001;&#x5B9E;&#x9A8C;&#xFF0C;work &#x4E0D; work &#x5F88;&#x591A;&#x90FD;&#x5728;&#x7EC6;&#x8282;&#x4E0A;&#x7684;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x5173;&#x6CE8;&#x7EC6;&#x8282;&#xFF0C;&#x7ED3;&#x679C;&#x4E5F;&#x641E;&#x4E0D;&#x51FA;&#x6765;&#x3002;&#x8FD9;&#x4E9B;&#x4FBF;&#x662F;&#x91CD;&#x8981;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x662F;&#xFF1A;1) &#x8981;&#x4F1A;&#x6293;&#x4F4F;&#x4E3B;&#x8981;&#x77DB;&#x76FE;&#x7684;&#x7EC6;&#x8282;&#xFF1B;2) &#x4E0D;&#x62D8;&#x6CE5;&#x4E8E;&#x7EC6;&#x8282;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x5B8F;&#x89C2;&#x7684;&#x4E1C;&#x897F;&#x6846;&#x4F4F;&#x6211;&#x4EEC;&#x7684;&#x60F3;&#x6CD5;&#xFF08;&#x6BD4;&#x5982;&#x9879;&#x76EE;&#x6574;&#x4F53;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x6846;&#x67B6;&#xFF0C;&#x65B9;&#x6848; &#x6216;&#x8005; &#x9879;&#x76EE;&#x6574;&#x4F53;&#x5B89;&#x6392; &#x6216;&#x8005; &#x5B9E;&#x9A8C;&#x7684; RoadMap&#xFF0C;&#x6392;&#x671F;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x505A;&#x7740;&#x505A;&#x7740;&#xFF0C;&#x5C31;&#x4F1A;&#x8D70;&#x504F;&#x4E86;&#xFF0C;&#x751A;&#x81F3;&#x811A;&#x8E29;&#x897F;&#x74DC;&#x76AE;&#xFF0C;&#x6ED1;&#x5230;&#x54EA;&#x91CC;&#x7B97;&#x54EA;&#x91CC;&#x3002;&#x6293;&#x5B8F;&#x89C2;&#xFF0C;&#x4FBF;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x5730;&#x9632;&#x6B62;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x65F6;&#x523B;&#x95EE;&#x95EE;&#x81EA;&#x5DF1;&#x6700;&#x8FD1;&#x5728;&#x505A;&#x5565;&#xFF0C;&#x548C;&#x5927;&#x76EE;&#x6807;&#x6709;&#x5565;&#x5173;&#x7CFB;&#x3002;&#x8FD9;&#x4E5F;&#x7B97;&#x662F;&#x201C;&#x4E0D;&#x5FD8;&#x521D;&#x5FC3;&#x201D;&#x5427;&#x3002;&#x7814;&#x7A76;&#x4E2D;&#x786E;&#x5B9E;&#x8FD8;&#x6709;&#x4E00;&#x7C7B;&#x662F;&#xFF0C;&#x4E0D;&#x53EF;&#x89C4;&#x5212;&#x7684;&#x7814;&#x7A76;&#x3002;&#x6BD4;&#x5982;&#x7A81;&#x7136;&#x53D1;&#x73B0;&#x4E86;&#x6709;&#x8DA3;&#x7684;&#x73B0;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x627E;&#x5230;&#x4E86;&#x6709;&#x8DA3;&#x7684;&#x7ED3;&#x8BBA;&#x3002;&#x8FD9;&#x7C7B;&#x7B97;&#x662F;&#x7814;&#x7A76;&#x4E2D;&#x7684;&#x60CA;&#x559C;&#x65F6;&#x523B;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x8BB2;&#x8981;&#x6293;&#x5B8F;&#x89C2;&#xFF0C;&#x4E0D;&#x662F;&#x8BF4;&#x8981;&#x6390;&#x706D;&#x8FD9;&#x7C7B;&#x60F3;&#x6CD5;&#x3002;&#x4ED6;&#x4EEC;&#x5E76;&#x4E0D;&#x77DB;&#x76FE;&#x7684;&#x3002;</p>
<h4 id="&#x5C0F;&#x8981;&#x505A;&#x597D;&#x7EC6;&#x8282;">&#x5C0F;&#x8981;&#x505A;&#x597D;&#x7EC6;&#x8282;</h4>
<p>&#x7814;&#x7A76;&#x4E2D;&#x7684;&#x7EC6;&#x8282;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x591A;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x9879;&#x76EE;&#x65B9;&#x6848;&#x7684;&#x7EC6;&#x8282;</li>
<li>&#x7814;&#x7A76;(paper)&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x6BD4;&#x5982;&#x600E;&#x4E48;&#x63CF;&#x8FF0;&#x3001;&#x903B;&#x8F91;&#x4E0A;&#x662F;&#x5426;&#x8BB2;&#x5F97;&#x901A;&#x7684;&#x7EC6;&#x8282;</li>
<li>&#x5B9E;&#x9A8C;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x4EE3;&#x7801;&#x7684;&#x7EC6;&#x8282;</li>
</ul>
<p>&#x7EC6;&#x8282;&#x5F88;&#x91CD;&#x8981;&#xFF1A;&#x65B9;&#x6848;&#x662F;&#x5426;&#x5B9E;&#x73B0;&#x5F97;&#x4E86;&#xFF0C;&#x5B9E;&#x9A8C;&#x80FD;&#x4E0D;&#x80FD;&#x505A;&#x51FA;&#x6765;&#xFF0C;&#x7EC6;&#x8282;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x5B9E;&#x9645;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x8010;&#x5FC3;&#x53BB;&#x5206;&#x6790;&#x7EC6;&#x8282;&#xFF1B;&#x8981;&#x4FDD;&#x6301;&#x5BF9;&#x7EC6;&#x8282;&#x5176;&#x4ED6;&#x53EF;&#x80FD;&#x6027;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x7B49;&#x7B49;&#x3002;</p>
<h4 id="&#x5982;&#x4F55;&#x628A;&#x63E1;&#x5927;&#x548C;&#x5C0F;&#x7684;&#x5C3A;&#x5EA6;">&#x5982;&#x4F55;&#x628A;&#x63E1;&#x5927;&#x548C;&#x5C0F;&#x7684;&#x5C3A;&#x5EA6;</h4>
<p>&#x540C;&#x65F6;&#x505A;&#x5230;&#x5927;&#x548C;&#x5C0F;&#x662F;&#x6709;&#x6311;&#x6218;&#x7684;&#x3002;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x7C7B;&#x6BD4;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x60F3;&#x6210;&#x4E00;&#x53EA;&#x5927;&#x9E1F;&#xFF0C;&#x4ECE;&#x5929;&#x4E0A;&#x4FEF;&#x77B0;&#x5730;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x65E2;&#x8981;&#x98DE;&#x5F97;&#x591F;&#x9AD8;&#xFF0C;&#x770B;&#x5230;&#x5730;&#x4E0B;&#x7684;&#x5168;&#x8C8C;&#xFF08;&#x6709;&#x65F6;&#x8FD8;&#x88AB;&#x4E91;&#x906E;&#x6321;&#x4E86;&#xFF09;&#xFF1B;&#x53C8;&#x80FD;&#x591F;&#x4FEF;&#x51B2;&#x4E0B;&#x6765;&#xFF0C;&#x8D34;&#x8FD1;&#x5730;&#x9762;&#xFF0C;&#x770B;&#x5230;&#x5177;&#x4F53;&#x7684;&#x5730;&#x9762;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x5230;&#x53EF;&#x5927;&#x53EF;&#x5C0F;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x53EA;&#x5927;&#x9E1F;&#x4E00;&#x4F1A;&#x513F;&#x722C;&#x5347;&#xFF0C;&#x4E00;&#x4F1A;&#x513F;&#x4FEF;&#x51B2;&#xFF0C;&#x5728;&#x4E0D;&#x65AD;&#x5730;&#x5207;&#x6362;&#x3002;&#x505A;&#x5230;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x672C;&#x8EAB;&#xFF0C;&#x6216;&#x8BB8;&#x4E5F;&#x4E0D;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#xFF1A;</p>
<ul>
<li>&#x9700;&#x8981;&#x4F9D;&#x8D56;&#x4E8E;&#x7ECF;&#x9A8C;</li>
<li>&#x8981;&#x6709;&#x654F;&#x611F;&#x6027;&#xFF1A;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x8BE5;&#x5B8F;&#x89C2;&#x770B;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x4EC0;&#x4E48;&#x8BE5;&#x770B;&#x7EC6;&#x8282;&#x4E86;&#xFF1B;&#x7EC6;&#x8282;&#x8981;&#x5173;&#x6CE8;&#x54EA;&#x4E9B;</li>
<li>&#x8FD8;&#x662F;&#x8981;&#x591A;&#x60F3;</li>
</ul>
<h2 id="&#x662F;&#x6B63;&#x786E;&#x7684;&#x8D8B;&#x52BF;&#x5417;">&#x662F;&#x6B63;&#x786E;&#x7684;&#x8D8B;&#x52BF;&#x5417;</h2>
<p>&#x8FD9;&#x5757;&#x53EF;&#x80FD;&#x662F;&#x4F1A;&#x6709;&#x4E89;&#x8BAE;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x6280;&#x672F;&#x53D1;&#x5C55;&#x6709;&#x5176;&#x5BA2;&#x89C2;&#x7684;&#x89C4;&#x5F8B;&#xFF0C;&#x4E00;&#x65E6;&#x6D89;&#x53CA;&#x5230;&#x5BF9;&#x9519;&#xFF0C;&#x5C31;&#x4F1A;&#x52A0;&#x5165;&#x4EF7;&#x503C;&#x5224;&#x65AD;&#x4E86;&#x3002;&#x8FD9;&#x91CC;&#x60F3;&#x8868;&#x8FBE;&#x7684;&#x89C2;&#x70B9;&#x662F;&#xFF1A;&#x6211;&#x4EEC;&#x8981;&#x5173;&#x6CE8;&#x6280;&#x672F;&#x672A;&#x6765;&#x7684;&#x53D1;&#x5C55;&#x3002;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x65B0;&#x7684;&#x6280;&#x672F;&#x4F1A;&#x5E26;&#x6765;&#x65B0;&#x7684;&#x53D8;&#x9769;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x79EF;&#x6781;&#x5173;&#x6CE8;&#x65B0;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#xFF1B;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x6700;&#x597D;&#x662F;&#x7814;&#x7A76;&#x672A;&#x6765;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x77ED;&#x671F;&#x7684;&#x672A;&#x6765;&#x8FD8;&#x662F;&#x957F;&#x671F;&#x7684;&#x672A;&#x6765;&#x3002;</p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x56DE;&#x8FC7;&#x5934;&#x53BB;&#x770B;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;&#xFF1A;&#x6280;&#x672F;&#x662F;&#x6709;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#x7684;&#xFF0C;&#x662F;&#x5F80;&#x7740;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x5411;&#x53D1;&#x5C55;&#x7684;&#x3002;</p>
<ul>
<li>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x7AD9;&#x5728;&#x73B0;&#x5728;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x90A3;&#x5C31;&#x8981;&#x5C3D;&#x91CF;&#x5F80;&#x6B63;&#x786E;&#x7684;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#x53BB;&#x601D;&#x8003;&#x3002;&#x63D0;&#x51FA;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6240;&#x4F5C;&#x7684;&#x63A2;&#x7A76;&#x662F;&#x5426;&#x5728;&#x8FD9;&#x4E2A;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#x4E4B;&#x4E0A;&#x3002;&#x8FD9;&#x91CC;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x8981;&#x9650;&#x5236;&#x4F4F;&#x6280;&#x672F;&#x53EA;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x8DEF;&#x5F84;&#x3002;&#x6280;&#x672F;&#x6709;&#x5404;&#x5F0F;&#x5404;&#x6837;&#x7684;&#x53D1;&#x5C55;&#x8DEF;&#x5F84;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#x66F4;&#x591A;&#x6307;&#x7684;&#x662F;&#x5B8F;&#x89C2;&#x7684;&#x4E00;&#x4E2A;&#x8D8B;&#x52BF;&#x3002;</li>
<li>&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x5047;&#x60F3;&#x7AD9;&#x5728;&#x672A;&#x6765;&#x7684;&#x89D2;&#x5EA6;&#xFF08;&#x4E94;&#x5E74;&#x4E4B;&#x540E;&#xFF0C;&#x5341;&#x5E74;&#x4E4B;&#x540E;&#xFF09;&#xFF0C;&#x56DE;&#x8FC7;&#x5934;&#x6765;&#x770B;&#xFF0C;&#x76EE;&#x524D;&#x6240;&#x505A;&#x7684;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#x662F;&#x5426;&#x6709;&#x5FC5;&#x8981;&#x3001;&#x6709;&#x4EF7;&#x503C;&#xFF1B;&#x5B83;&#x662F;&#x5426;&#x53CD;&#x800C;&#x963B;&#x788D;&#x4E86;&#x6280;&#x672F;&#x7684;&#x8FDB;&#x6B65;&#x3002;&#x8FD9;&#x6837;&#x60F3;&#x7684;&#x8BDD;&#xFF0C;&#x80FD;&#x591F;&#x66F4;&#x597D;&#x5730;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x7406;&#x89E3;&#x6240;&#x505A;&#x5DE5;&#x4F5C;&#x7684;&#x4EF7;&#x503C;&#x548C;&#x610F;&#x4E49;&#x3002;</li>
</ul>
<h2 id="&#x7814;&#x7A76;&#x8981;&#x5206;&#x6E05;&#x56DB;&#x4E2A;&#x65B9;&#x9762;">&#x7814;&#x7A76;&#x8981;&#x5206;&#x6E05;&#x56DB;&#x4E2A;&#x65B9;&#x9762;</h2>
<p>&#x7814;&#x7A76;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x65F6;&#x523B;&#x660E;&#x767D;&#x81EA;&#x5DF1;&#x5904;&#x4E8E;&#x54EA;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5BF9;&#x4E8E;&#x521A;&#x5165;&#x95E8;&#x7684;&#x540C;&#x5B66;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x6E05;&#x695A;&#xFF0C;&#x7814;&#x7A76;&#x4F1A;&#x5F88;&#x96BE;&#x8FDB;&#x884C;&#x4E0B;&#x53BB;&#x3002;
&#x6BD4;&#x5982;&#xFF0C;&#x521A;&#x5165;&#x95E8;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x5728;&#x8BA8;&#x8BBA;&#x6C47;&#x62A5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F80;&#x5F80;&#x4F1A;&#x8BF4;&#xFF0C;&#x4ED6;&#x8FC7;&#x53BB;&#x7684;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5C1D;&#x8BD5;&#x4E86;&#x8FD9;&#x4E2A;&#x90A3;&#x4E2A;&#xFF0C;&#x5206;&#x522B;&#x5F97;&#x5230;&#x4E86;&#x4EC0;&#x4E48;&#x7ED3;&#x679C;&#xFF08;&#x5F53;&#x7136;&#x5927;&#x90E8;&#x5206;&#x662F;&#x4E0D;&#x592A;&#x597D;&#x7684;&#x7ED3;&#x679C;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x6CA1;&#x6709;&#x4E86;&#xFF0C;&#x4F3C;&#x4E4E;&#x5728;&#x7B49;&#x7740;&#x5BF9;&#x65B9;&#x7ED9;&#x4ED6;&#x5206;&#x6790;&#x548C;&#x786E;&#x5B9A;&#x4E0B;&#x4E00;&#x6B65;&#x7684;&#x884C;&#x52A8;&#x6B65;&#x9AA4;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x4E0D;&#x5BF9;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4E0D;&#x662F;&#x673A;&#x5668;&#xFF0C;&#x8F93;&#x5165;&#x6307;&#x4EE4;&#xFF0C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF0C;&#x7136;&#x540E;&#x7B49;&#x7740;&#x4E0B;&#x4E00;&#x4E2A;&#x6307;&#x4EE4;&#x3002;&#x6709;&#x4E86;&#x5B9E;&#x9A8C;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x5206;&#x6790;&#xFF1B;&#x4E0D;&#x597D;&#x7684;&#x7ED3;&#x679C;&#x4E5F;&#x4E0D;&#x662F;&#x574F;&#x4E8B;&#xFF0C;&#x9762;&#x5BF9;&#x4E0D;&#x597D;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5E0C;&#x671B;&#x6709;&#x4E00;&#x4E2A;&#x5206;&#x6790;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x7ED3;&#x679C;&#x548C;&#x6211;&#x4EEC;&#x60F3;&#x7684;&#x4E0D;&#x540C;&#xFF1B;&#x600E;&#x4E48;&#x8BF4;&#x670D;&#x81EA;&#x5DF1;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x662F;&#x5BA2;&#x89C2;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5B9E;&#x73B0;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8C03;&#x53C2;&#x7684;&#x95EE;&#x9898;&#x7B49;&#x7B49;&#xFF1B;&#x6709;&#x6CA1;&#x6709;&#x4E00;&#x4E9B;&#x201C;&#x63A2;&#x6D4B;&#x7684;&#x624B;&#x6BB5;&#x201D;&#x80FD;&#x591F;&#x65C1;&#x8BC1;&#x3002;&#x5728;&#x8BA8;&#x8BBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x60F3;&#x9488;&#x5BF9;&#x8FD9;&#x4E9B;&#x521D;&#x6B65;&#x5206;&#x6790;&#xFF0C;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x5206;&#x6790;&#x548C;&#x8BA8;&#x8BBA;&#x3002;&#x800C;&#x4E0D;&#x662F;&#x629B;&#x51FA;&#x4E00;&#x4E2A;&#x7ED3;&#x679C;&#xFF0C;&#x5176;&#x4ED6;&#x90FD;&#x4E0D;&#x5173;&#x6211;&#x4E8B;&#x7684;&#x611F;&#x89C9;&#x3002;</p>
<p>&#x8FD9;&#x56DB;&#x4E2A;&#x65B9;&#x9762;&#x662F;&#xFF1A;</p>
<center><img src="imgs/02-&#x7814;&#x7A76;&#x56DB;&#x4E2A;&#x65B9;&#x9762;.png" alt="02-&#x7814;&#x7A76;&#x56DB;&#x4E2A;&#x65B9;&#x9762;" width="600"></center>

<ol>
<li><strong>Assumption</strong>. &#x6211;&#x4EEC;&#x6709;idea&#x6216;&#x8DD1;&#x5B9E;&#x9A8C;&#x4E4B;&#x524D;&#xFF0C;&#x4E00;&#x5B9A;&#x662F;&#x4F1A;&#x6709;&#x5047;&#x8BBE;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x610F;&#x8BC6;&#x5230;&#x3002;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#x65F6;&#xFF0C;&#x5E0C;&#x671B;&#x5B83;&#x5728; xxx &#x4EFB;&#x52A1;&#x4E0A;&#x4F1A; work&#xFF0C;&#x8FD9;&#x80CC;&#x540E;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x5047;&#x5B9A;&#x5B83; work &#x7684;&#x903B;&#x8F91;/story&#xFF0C;&#x4EE5;&#x7528;&#x6765;&#x8BF4;&#x670D;&#x81EA;&#x5DF1;&#x4E3A;&#x4EC0;&#x4E48;&#x5B83;&#x4F1A; work&#x3002;&#xFF08;&#x4E0D;&#x7136;&#xFF0C;&#x4F60;&#x81EA;&#x5DF1;&#x90FD;&#x4E0D;&#x575A;&#x4FE1;&#x8FD9;&#x4E2A; idea&#xFF0C;&#x51ED;&#x5565;&#x4F1A;&#x53BB;&#x5C1D;&#x8BD5;&#x5462;&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x5206;&#x6790;&#x5F97;&#x66F4;&#x591A;&#xFF0C;&#x4FBF;&#x4F1A;&#x66F4;&#x52A0;&#x6E05;&#x695A;&#xFF1A;&#x8FD9;&#x4E2A;&#x5047;&#x5B9A;&#x5B83; work &#x7684;&#x4E00;&#x5957;&#x903B;&#x8F91;/story&#x4E2D;&#xFF0C;&#x53C8;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x5176;&#x4ED6;&#x7684;&#x5047;&#x5B9A;&#x548C;&#x4F9D;&#x8D56;&#x3002;&#x6211;&#x4EEC;&#x5BF9;&#x8FD9;&#x4E9B;&#x5047;&#x5B9A;&#x7406;&#x89E3;&#x7684;&#x8D8A;&#x591A;&#xFF0C;&#x5F53;&#x51FA;&#x73B0;&#x4E0D;&#x597D;&#x7ED3;&#x679C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4FBF;&#x80FD;&#x591F;&#x66F4;&#x597D;&#x63A8;&#x6D4B;&#x95EE;&#x9898;&#x51FA;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x5E94;&#x5BF9;&#x65B9;&#x6CD5;&#x6765;&#x5B9A;&#x4F4D;&#x95EE;&#x9898;&#xFF0C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;</li>
<li><strong>Expectation</strong>. &#x9884;&#x671F;&#x662F;&#x548C;&#x5047;&#x5B9A;&#x5F88;&#x76F8;&#x5173;&#x7684;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x6709;&#x5047;&#x5B9A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x5B9A;&#x4E5F;&#x5305;&#x542B;&#x4E86;&#x9884;&#x671F;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x6709;&#x4E00;&#x4E2A; idea&#xFF0C;&#x4FBF;&#x4F1A;&#x6709;&#x9884;&#x671F;&#x7684;&#x7ED3;&#x679C;&#xFF1B;&#x6709;&#x4E00;&#x4E2A;&#x5047;&#x5B9A;&#x5B83; work &#x7684;&#x903B;&#x8F91;/story&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x4FBF;&#x4F1A;&#x9884;&#x671F;&#x5B83;&#x4F1A;&#x5448;&#x73B0;&#x600E;&#x6837;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x53EF;&#x4EE5;&#x9884;&#x671F;&#x89C2;&#x5BDF;&#x7684;&#x73B0;&#x8C61;&#x6765;&#x8BF4;&#x660E;&#x786E;&#x5B9E;&#x662F;&#x6309;&#x7167;&#x6211;&#x8BBE;&#x60F3;&#x7684;&#x903B;&#x8F91;/story&#x8FD0;&#x884C;&#x7684;&#x3002;&#x751A;&#x81F3;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x8DD1;&#x4E00;&#x4E2A;&#x5B9E;&#x9A8C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x5B9A;&#x4E5F;&#x4F1A;&#x6709;&#x4E86;&#x5BF9;&#x4ED6;&#x7684;&#x9884;&#x671F;&#xFF1A;&#x7ED3;&#x679C;&#x548C;&#x4E2D;&#x95F4;&#x7684;&#x5448;&#x73B0;&#x3002;&#x90A3;&#x65E0;&#x8BBA;&#x540E;&#x9762;&#x662F;&#x7B26;&#x5408;&#x9884;&#x671F;&#x7684;&#xFF0C;&#x8FD8;&#x662F;&#x4E0D;&#x7B26;&#x5408;&#x9884;&#x671F;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5176;&#x5B9E;&#x90FD;&#x53EF;&#x4EE5;&#x5206;&#x6790;&#x4E86;&#x3002;</li>
<li><strong>Observation</strong>. &#x89C2;&#x5BDF;&#x662F;&#x5F53;&#x6211;&#x4EEC;&#x8DD1;&#x4E86;&#x5B9E;&#x9A8C;&#x4E4B;&#x540E;&#xFF0C;&#x5BF9;&#x5B9E;&#x9A8C;&#x7ED3;&#x679C;&#x7684;&#x4E00;&#x4E2A;&#x6574;&#x7406;&#x3002;&#x6709;&#x65F6;&#x5019;&#x7ED3;&#x679C;&#x4F1A;&#x7E41;&#x6742;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4ECE;&#x4E0D;&#x540C;&#x7684;&#x7EF4;&#x5EA6;&#xFF0C;&#x7406;&#x51FA;&#x51E0;&#x6761;&#x89C2;&#x5BDF;&#x7684;&#x7EBF;&#xFF0C;&#x4EE5;&#x4FBF;&#x6211;&#x4EEC;&#x66F4;&#x597D;&#x5730;&#x5206;&#x6790;&#x3002;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x8DD1;&#x5B8C;&#x5B9E;&#x9A8C;&#x6B62;&#x4E8E;&#x6B64;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x5F62;&#x6210;&#x4E0D;&#x4E86;&#x4E00;&#x4E2A;&#x95ED;&#x73AF;&#xFF0C;&#x8FDB;&#x800C;&#x4E0D;&#x80FD;&#x5728;&#x8BA4;&#x8BC6;&#x4E0A;&#x6709;&#x4E00;&#x4E2A;&#x63D0;&#x9AD8;&#x3002;</li>
<li><strong>Analysis</strong>. &#x5206;&#x6790;&#x662F;&#x9700;&#x8981;&#x5BF9;&#x5B9E;&#x9A8C;&#x7684;&#x7ED3;&#x679C;&#xFF08;Observation&#xFF09;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x6DF1;&#x523B;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x8FDB;&#x800C;&#x4FEE;&#x6B63;&#x6211;&#x4EEC;&#x7684;&#x5047;&#x8BBE;&#x4E0E;&#x9884;&#x671F;&#xFF0C;&#x8FDB;&#x884C;&#x4E0B;&#x4E00;&#x6B65;&#x7684;&#x5B9E;&#x9A8C;&#x4E0E;&#x9A8C;&#x8BC1;&#x3002;&#x7ED3;&#x5408;&#x4E4B;&#x524D;&#x7684;&#x9884;&#x671F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5206;&#x6790;&#xFF1A;&#x5982;&#x679C;&#x7B26;&#x5408;&#x9884;&#x671F;&#xFF0C;&#x90A3;&#x4E48;&#x662F;&#x5426;&#x6309;&#x7167;&#x9884;&#x671F;&#x7684;&#x903B;&#x8F91;/story&#x4EA7;&#x751F;&#x7684;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#xFF1B;&#x5982;&#x679C;&#x4E0D;&#x7B26;&#x5408;&#x9884;&#x671F;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x7B26;&#x5408;&#xFF0C;&#x662F;&#x6211;&#x4E4B;&#x524D;&#x63D0;&#x51FA;&#x5047;&#x8BBE;&#x548C;&#x9884;&#x671F;&#x7684;&#x65F6;&#x5019;&#x5FFD;&#x7565;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x8FD8;&#x662F;&#x7F3A;&#x5C11;&#x4E86;&#x76F8;&#x5173;&#x7684;&#x8BA4;&#x8BC6;&#x548C;&#x7ECF;&#x9A8C;&#xFF0C;&#x4FEE;&#x6B63;&#x4E4B;&#x540E;&#x7684;&#x89E3;&#x91CA;&#x662F;&#x5426;&#x80FD;&#x591F;&#x8BF4;&#x670D;&#x81EA;&#x5DF1;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x4E0D;&#x662F;bug&#x6216;&#x8005;&#x8C03;&#x53C2;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x662F;&#x5BA2;&#x89C2;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x5206;&#x6790;&#x662F;&#x5F62;&#x6210;&#x95ED;&#x73AF;&#x7684;&#x5173;&#x952E;&#x4E00;&#x73AF;&#xFF0C;&#x5B83;&#x5FC5;&#x7136;&#x6709;&#x6240;&#x5F97;&#xFF1A;&#x662F;&#x6211;&#x4EEC;&#x54EA;&#x91CC;&#x5FFD;&#x7565;&#x4E86;&#xFF0C;&#x6CA1;&#x6709;&#x8BA4;&#x8BC6;&#x5230;&#xFF1B;&#x6216;&#x8005;&#x4E0B;&#x4E00;&#x6B65;&#x8BE5;&#x5982;&#x4F55;&#x884C;&#x52A8;&#x3002;</li>
</ol>
<p>&#x6211;&#x4EEC;&#x5E94;&#x80FD;&#x591F;&#x65F6;&#x523B;&#x53CD;&#x89C2;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x662F;&#x5904;&#x4E8E;&#x54EA;&#x4E2A;&#x9636;&#x6BB5;&#x4E2D;&#x3002;
&#x4F5C;&#x4E3A;&#x7814;&#x7A76;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4EFB;&#x52A1;&#x662F;&#x8981;&#x6709;&#x66F4;&#x591A;&#x7684;Assumption&#xFF0C;&#x7136;&#x540E;&#x5F97;&#x5230;&#x9A8C;&#x8BC1;&#xFF0C;&#x6216;&#x8005; insights&#xFF1B;&#x6211;&#x4EEC;&#x7684;&#x4EFB;&#x52A1;&#x4E0D;&#x662F;&#x6B62;&#x4E8E;Observation&#xFF0C; &#x800C;&#x8981;&#x6709;Analysis&#xFF0C;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x95ED;&#x73AF;&#xFF0C;&#x87BA;&#x65CB;&#x5F0F;&#x4E0A;&#x5347;&#x3002;</p>
<h2 id="&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x8BE5;&#x6539;&#x8FDB;&#x4E86;&#xFF1F;">&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x8BE5;&#x6539;&#x8FDB;&#x4E86;&#xFF1F;</h2>
<p>&#x6B63;&#x5982;&#x524D;&#x9762;&#x8BF4;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x6709;&#x8FED;&#x4EE3;&#x7684;&#x601D;&#x60F3;&#x3002;&#x90A3;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x8BE5;&#x6539;&#x8FDB;&#x4E86;&#x5462;&#xFF1F;</p>
<p>&#x603B;&#x7684;&#x8BF4;&#x6765;&#xFF0C;&#x9700;&#x8981;&#x654F;&#x611F;&#x4E00;&#x4E9B;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E9B;&#x6D41;&#x7A0B;&#x3001;&#x65B9;&#x6848;&#x8BA9;&#x81EA;&#x5DF1;&#x611F;&#x89C9;&#x4E0D;&#x723D;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;&#x5F88;&#x9EBB;&#x70E6;&#xFF0C;&#x6216;&#x8005;&#x5F88;&#x91CD;&#x590D;&#xFF0C;&#x6216;&#x8005;&#x5E76;&#x4E0D;&#x4F18;&#x7F8E;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x5C31;&#x8981;&#x8003;&#x8651;&#x53BB;&#x6539;&#x8FDB;&#x4E86;&#x3002;</p>
<p>&#x5C31;&#x6211;&#x81EA;&#x5DF1;&#x800C;&#x8A00;&#xFF0C;<a href="https://github.com/xinntao/BasicSR" target="_blank">BasicSR</a> &#x5C31;&#x662F;&#x8FD9;&#x6837;&#x5728;&#x4E00;&#x6B65;&#x6B65;&#x7684;&#x6539;&#x8FDB;&#x4E2D;&#x8FDB;&#x5316;&#x800C;&#x6765;&#x7684;&#x3002;&#x81EA;&#x5DF1;&#x8DD1;&#x5B9E;&#x9A8C;&#x9047;&#x5230;&#x9EBB;&#x70E6;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4E0D;&#x723D;&#x4E86;&#xFF0C;&#x5C31;&#x60F3;&#x7740;&#x8981;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x65B0;&#x529F;&#x80FD;&#xFF0C;&#x6216;&#x8005;&#x6539;&#x8FDB;&#x73B0;&#x6709;&#x529F;&#x80FD;&#x3002;&#x53E6;&#x5916;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x7814;&#x7A76;&#x4E2D;&#x7ECF;&#x5E38;&#x8981;&#x67E5;&#x770B;&#x548C;&#x6BD4;&#x8F83;&#x56FE;&#x7247;&#x7684;&#x89C6;&#x89C9;&#x6548;&#x679C;&#xFF0C;&#x73B0;&#x6709;&#x7684;&#x65B9;&#x6848;&#x6CA1;&#x6709;&#x5F88;&#x597D;&#x5730;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x6162;&#x6162;&#x5F00;&#x53D1;&#x4E86; <a href="https://github.com/xinntao/HandyView" target="_blank">HandyView</a>&#x3002;&#x518D;&#x540E;&#x6765;&#xFF0C;&#x505A;&#x4EBA;&#x8138;&#x76F8;&#x5173;&#x4EFB;&#x52A1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53D1;&#x73B0; detection, alignment, parsing &#x8FD9;&#x4E9B;&#x662F;&#x57FA;&#x7840;&#x529F;&#x80FD;&#xFF0C;&#x6BCF;&#x6B21;&#x90FD;&#x8981;&#x91CD;&#x590D;&#x8C03;&#x7528;&#xFF0C;&#x4E5F;&#x4E0D;&#x786E;&#x5B9A;&#x54EA;&#x4E2A;&#x65B9;&#x6848;&#x662F;&#x76EE;&#x524D;&#x6700;&#x4F18;&#x7684;&#xFF0C;&#x5F88;&#x9EBB;&#x70E6;&#xFF0C;&#x4E5F;&#x5F88;&#x91CD;&#x590D;&#x3002;&#x5C31;&#x60F3;&#x7740;&#x6539;&#x8FDB;&#xFF0C;&#x628A;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x5355;&#x72EC;&#x51FA;&#x6765;&#xFF0C;&#x5F62;&#x6210;&#x4E86; <a href="https://github.com/xinntao/facexlib" target="_blank">facexlib</a>&#x3002;&#x5F53;&#x7136;&#x66F4;&#x591A;&#x7684;&#x662F;&#x5E73;&#x65F6;&#x7684;&#x4EE3;&#x7801;&#x548C;&#x811A;&#x672C;&#x4E2D;&#x4F53;&#x73B0;&#x51FA;&#x6765;&#x7684;&#x3002;&#x603B;&#x7684;&#x8BF4;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x6709;&#x6539;&#x8FDB;&#x7684;&#x610F;&#x8BC6;&#xFF0C;&#x5E76;&#x4E14;&#x8981;&#x8DB3;&#x591F;&#x654F;&#x611F;&#x3002;&#x8BE5;&#x61D2;&#x60F0;&#x7684;&#x5730;&#x65B9;&#x8981;&#x61D2;&#x60F0;&#x4E00;&#x4E9B;&#xFF0C;&#x61D2;&#x60F0;&#x624D;&#x63A8;&#x52A8;&#x7740;&#x8BA9;&#x6211;&#x4EEC;&#x5F00;&#x53D1;&#x66F4;&#x597D;&#x7684;&#xFF08;&#x81EA;&#x52A8;&#x5316;&#x7684;&#xFF09;&#x6D41;&#x7A0B;&#x3002;</p>
<h2 id="&#x65F6;&#x95F4;&#x76F8;&#x5173;">&#x65F6;&#x95F4;&#x76F8;&#x5173;</h2>
<h4 id="&#x5408;&#x7406;&#x5B89;&#x6392;&#x65F6;&#x95F4;">&#x5408;&#x7406;&#x5B89;&#x6392;&#x65F6;&#x95F4;</h4>
<p>&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5F88;&#x591A;&#xFF0C;&#x60F3;idea&#xFF0C;&#x8BBA;&#x6587;&#x9605;&#x8BFB;&#xFF0C;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#xFF0C;&#x8DD1;&#x5B9E;&#x9A8C;&#xFF0C;&#x7EF4;&#x62A4;&#x5B9E;&#x9A8C;&#xFF0C;&#x6574;&#x7406;&#x7ED3;&#x679C;&#xFF0C;&#x5206;&#x6790;&#x603B;&#x7ED3;&#x7B49;&#x7B49;&#x3002;&#x6709;&#x4E9B;&#x662F;&#x6709;&#x4F9D;&#x8D56;&#x7684;&#xFF0C;&#x6709;&#x4E9B;&#x662F;&#x76F8;&#x5BF9;&#x72EC;&#x7ACB;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x8981;&#x628A;&#x8FD9;&#x4E9B;&#x975E;&#x7EBF;&#x6027;&#x7684;&#x4E8B;&#x60C5;&#x5B89;&#x6392;&#x653E;&#x8FDB;&#x7EBF;&#x6027;&#x7684;&#x65F6;&#x95F4;&#x91CC;&#x9762;&#xFF0C;&#x8FD9;&#x5C31;&#x8981;&#x5408;&#x7406;&#x5B89;&#x6392;&#x65F6;&#x95F4;&#x4E86;&#x3002;</p>
<p>&#x5B83;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x5C0F;&#x5B66;&#x751F;&#x7684;&#x9898;&#x76EE;&#xFF1A;</p>
<blockquote>
<p>&#x5C0F;&#x660E;&#x5E2E;&#x5988;&#x5988;&#x505A;&#x996D;&#x3002;&#x6DD8;&#x7C73;&#xFF1A;3&#x5206;&#x949F;&#xFF0C;&#x716E;&#x996D;&#xFF1A;25&#x5206;&#x949F;&#xFF0C;&#x6D17;&#x83DC;&#xFF1A;8&#x5206;&#x949F;&#xFF0C;&#x5207;&#x83DC;&#xFF1A;5&#x5206;&#x949F;&#xFF0C;&#x7092;&#x83DC;&#xFF1A;10&#x5206;&#x949F;&#x3002;&#x8BF7;&#x95EE;&#x5C0F;&#x660E;&#x600E;&#x4E48;&#x5B89;&#x6392;&#xFF0C;&#x624D;&#x80FD;&#x4F7F;&#x5F97;&#x505A;&#x5B8C;&#x8FD9;&#x4E9B;&#x4E8B;&#x6240;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x6700;&#x5C11;&#xFF1F;</p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x8981;&#x81EA;&#x5DF1;&#x6392;&#x51FA;&#x4E00;&#x4E2A;&#x7532;&#x4E59;&#x4E19;&#x4E01;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x6765;&#x3002;</p>
<h4 id="&#x5FAE;&#x5904;&#x7406;&#x5668;&#x6D41;&#x6C34;&#x7EBF;">&#x5FAE;&#x5904;&#x7406;&#x5668;&#x6D41;&#x6C34;&#x7EBF;</h4>
<p>&#x6211;&#x4EEC;&#x5B9E;&#x9A8C;&#x6709;&#x4E00;&#x4E2A;&#x7279;&#x70B9;&#xFF0C;&#x9700;&#x8981;&#x7B49;&#x5F85; &#x7A0B;&#x5E8F;&#x5728;GPU&#x4E0A;&#x8DD1;&#x5B8C;&#xFF0C;&#x5C11;&#x5219;&#x4E00;&#x4E24;&#x5929;&#xFF0C;&#x52A8;&#x5219;&#x4E09;&#x56DB;&#x5929;&#xFF0C;&#x751A;&#x81F3;&#x4E00;&#x5468;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6BCF;&#x6B21;&#x90FD;&#x7B49;&#x5230;&#x5B9E;&#x9A8C;&#x7ED3;&#x675F;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5206;&#x6790;&#xFF0C;&#x6709;&#x4E86;&#x53CD;&#x9988;&#x518D;&#x6539;&#x8FDB;&#x5B9E;&#x9A8C;&#xFF0C;&#x518D;&#x8FDB;&#x884C;&#x4E0B;&#x4E00;&#x8F6E;&#x7684;&#x5B9E;&#x9A8C;&#xFF0C;&#x90A3;&#x9879;&#x76EE;&#x7684;&#x5468;&#x671F;&#x5C31;&#x88AB;&#x5927;&#x5927;&#x62C9;&#x957F;&#x4E86;&#x3002;&#x4E00;&#x4E2A;&#x6708;&#x4E5F;&#x8DD1;&#x4E0D;&#x4E86;&#x51E0;&#x8F6E;&#x5B9E;&#x9A8C;&#x3002;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF0C;&#x5C31;&#x662F;&#x8981;&#x53C2;&#x8003;&#x5FAE;&#x5904;&#x7406;&#x5668;&#x6D41;&#x6C34;&#x7EBF;&#x7684;&#x65B9;&#x6848;&#x3002;</p>
<center><img src="imgs/02-&#x5FAE;&#x5904;&#x7406;&#x5668;&#x6D41;&#x6C34;&#x7EBF;.png" alt="02-&#x5FAE;&#x5904;&#x7406;&#x5668;&#x6D41;&#x6C34;&#x7EBF;" width="600"></center>

<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7C7B;&#x6BD4;&#x8FC7;&#x6765;&#xFF0C;&#x4E00;&#x4E2A;&#x65F6;&#x949F;&#x5468;&#x671F;&#x5C31;&#x662F;&#x4E00;&#x5929;&#x3002;&#x56DB;&#x4E2A;&#x6267;&#x884C;&#x9636;&#x6BB5;&#xFF0C;&#x5BF9;&#x5E94; &#x5047;&#x8BBE;&#xFF08;&#x60F3;&#x6CD5;&#xFF0C;&#x9605;&#x8BFB;&#x8BBA;&#x6587;&#xFF09;&#xFF0C;&#x9884;&#x671F;&#xFF08;&#x5B9E;&#x9A8C;&#x8BBE;&#x8BA1;&#xFF0C;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#xFF09;&#xFF0C;&#x89C2;&#x5BDF;&#xFF08;&#x8DD1;&#x5B9E;&#x9A8C;&#xFF0C;&#x51FA;&#x7ED3;&#x679C;&#xFF09;&#x548C; &#x5206;&#x6790;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x6700;&#x7406;&#x60F3;&#x7684;&#x60C5;&#x51B5;&#x662F;&#x6BCF;&#x5929;&#x90FD;&#x6709;&#x65B0;&#x7684;&#x5B9E;&#x9A8C;&#x8DD1;&#x4E0A;&#xFF0C;&#x6BCF;&#x5929;&#x90FD;&#x6709;&#x53EF;&#x5206;&#x6790;&#x7684;&#x5B9E;&#x9A8C;&#x7ED3;&#x679C;&#xFF0C;&#x5F97;&#x5230;&#x597D;&#x7684;&#x7ED3;&#x679C;&#x6216;&#x8005;insights&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x5927;&#x5927;&#x7F29;&#x77ED;&#x4E86;&#x9879;&#x76EE;&#x7684;&#x5468;&#x671F;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x662F;&#x5F88;&#x7406;&#x60F3;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x56E0;&#x4E3A;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x4E0D;&#x80FD;&#x90A3;&#x4E48;&#x7CBE;&#x51C6;&#x7684;&#x5B89;&#x6392;&#xFF1B;&#x6709;&#x4E9B;&#x5B9E;&#x9A8C;&#x4E5F;&#x6709;&#x524D;&#x540E;&#x4F9D;&#x8D56;&#x3002;&#x4F46;&#x603B;&#x7684;&#x601D;&#x60F3;&#x5E94;&#x8BE5;&#x662F;&#x4EFF;&#x7167;&#x5FAE;&#x5904;&#x7406;&#x5668;&#x6D41;&#x6C34;&#x7EBF;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<h4 id="&#x6211;&#x4EEC;&#x7684;&#x65F6;&#x95F4;--&#x6211;&#x4EEC;&#x7684;&#x65F6;&#x95F4;--&#x673A;&#x5668;&#x7684;&#x65F6;&#x95F4;">&#x6211;&#x4EEC;&#x7684;&#x65F6;&#x95F4; = &#x6211;&#x4EEC;&#x7684;&#x65F6;&#x95F4; + &#x673A;&#x5668;&#x7684;&#x65F6;&#x95F4;</h4>
<p>&#x8FD9;&#x4E2A;&#x662F;&#x4E4B;&#x524D;&#x6253;&#x6BD4;&#x8D5B;&#x603B;&#x7ED3;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#x3002;&#x8FD9;&#x4E2A;&#x548C;&#x6211;&#x4EEC;&#x7684;&#x7814;&#x7A76;&#x65B9;&#x5F0F;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#x3002;&#x6211;&#x4EEC;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x662F;&#x5728;&#x4E0D;&#x65AD;&#x5C1D;&#x8BD5;&#xFF0C;&#x7B49;&#x673A;&#x5668;&#x7684;&#x7ED3;&#x679C;&#x3002;
&#x673A;&#x5668;&#x6240;&#x9700;&#x7684;&#x65F6;&#x95F4;&#x662F;&#x4E0D;&#x53EF;&#x538B;&#x7F29;&#x7684;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5408;&#x7406;&#x5B89;&#x6392;&#xFF0C;&#x8BA9;&#x5B9E;&#x9A8C;&#x5148;&#x8DD1;&#x8D77;&#x6765;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x518D;&#x4F11;&#x606F;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x673A;&#x5668;&#x5728;&#x8DD1;&#x3002;&#x4ECE;&#x67D0;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x6709;&#x6548;&#x65F6;&#x95F4;&#x5C31;&#x53D8;&#x591A;&#x5566;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x4E5F;&#x5BFC;&#x81F4;&#xFF0C;&#x4F1A;&#x8D8A;&#x7761;&#x8D8A;&#x665A;=-= &#x56E0;&#x6B64;&#x665A;&#x7761;&#x53D8;&#x6210;&#x4E86;&#x5FC5;&#x7136;&#x7684;&#x7ED3;&#x679C;...</p>
<h4 id="&#x7A7A;&#x95F4;&#x6362;&#x65F6;&#x95F4;">&#x7A7A;&#x95F4;&#x6362;&#x65F6;&#x95F4;</h4>
<p>&#x8FD9;&#x4E2A;&#x5176;&#x5B9E;&#x5DF2;&#x7ECF;&#x9690;&#x542B;&#x5728; &#x5408;&#x7406;&#x5B89;&#x6392;&#x65F6;&#x95F4; &#x548C; &#x5FAE;&#x5904;&#x7406;&#x5668;&#x6D41;&#x6C34;&#x7EBF; &#x4E2D;&#x4E86;&#x3002;
&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x5B9E;&#x9A8C;&#x90FD;&#x4F1A;&#x6709;&#x4F9D;&#x8D56;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x65F6;&#x5019;&#x5E76;&#x4E0D;&#x80FD;&#x7B80;&#x5355;&#x5730;&#x5E76;&#x884C;&#x5904;&#x7406;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x73B0;&#x6709;&#x7684;&#x8D44;&#x6E90;&#x60C5;&#x51B5;&#xFF0C;&#x5728;&#x65F6;&#x95F4;&#x548C;&#x8D44;&#x6E90;&#xFF08;&#x7A7A;&#x95F4;&#xFF09;&#x4E0A;&#x53D6;&#x4E00;&#x4E2A;&#x5E73;&#x8861;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E09;&#x7EC4;&#x5B9E;&#x9A8C; A, B &#x548C; C&#x3002; &#x4ED6;&#x4EEC;&#x662F;&#x6709;&#x4F9D;&#x8D56;&#x7684;&#xFF0C;B &#x4F9D;&#x8D56;&#x4E8E; A&#xFF0C; C&#x4F9D;&#x8D56;&#x4E8E;B&#x3002;A&#x6709;&#x4E24;&#x79CD;&#x53D8;&#x4F53;&#xFF0C;B&#x6709;&#x4E09;&#x79CD;&#x53D8;&#x4F53;&#xFF0C;C&#x6709;&#x4E24;&#x79CD;&#x53D8;&#x4F53;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x5E0C;&#x671B;&#x627E;&#x5230;&#x6700;&#x6709;&#x6548;&#x7684;&#x4E00;&#x7EC4;setting &#xFF08;&#x6BD4;&#x65B9;&#x8BF4; A1-B3-C2&#xFF09;&#x3002;</p>
<center><img src="imgs/02-&#x7A7A;&#x95F4;&#x6362;&#x65F6;&#x95F4;.png" alt="02-&#x7A7A;&#x95F4;&#x6362;&#x65F6;&#x95F4;" width="500"></center>

<p>&#x4E00;&#x79CD;&#x505A;&#x6CD5;&#x662F;&#x5148;&#x8DD1;A1&#x548C;A2&#xFF0C;&#x786E;&#x5B9A;&#x54EA;&#x4E2A;&#x6700;&#x597D;&#x3002;&#x7136;&#x540E;&#x57FA;&#x4E8E;&#x6B64;&#xFF0C;&#x518D;&#x8DD1;B&#x7EC4;&#x5B9E;&#x9A8C;&#xFF0C;&#x6700;&#x540E;&#x8DD1;C&#x7EC4;&#x5B9E;&#x9A8C;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x9700;&#x8981;&#x8DD1; 2+3+2=7&#x7EC4;&#x5B9E;&#x9A8C;&#xFF0C;&#x9700;&#x8981;&#x4E09;&#x4E2A;&#x5B9E;&#x9A8C;&#x5468;&#x671F;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8D44;&#x6E90;&#x591F;&#x591A;&#x7684;&#x8BDD;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x628A; 2x3x2=12&#x7EC4;&#x5B9E;&#x9A8C;&#x90FD;&#x8DD1;&#x4E0A;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5B9E;&#x9A8C;&#x5468;&#x671F;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x662F;&#x6781;&#x81F4;&#x7684;&#x7A7A;&#x95F4;&#x6362;&#x65F6;&#x95F4;&#x4E86;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5462;&#xFF0C;&#x6211;&#x4EEC;&#x5F80;&#x5F80;&#x662F;&#x5728;&#x8D44;&#x6E90;&#x548C;&#x65F6;&#x95F4;&#x4E0A;&#x53D6;&#x4E00;&#x4E2A;&#x5E73;&#x8861;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x4F1A;&#x6240;&#x6709;&#x7684;&#x7EC4;&#x5408;&#x90FD;&#x8DD1;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x4F1A;&#x6709;&#x9884;&#x671F;&#xFF0C;&#x6BD4;&#x5982;A1&#x6210;&#x529F;&#x7684;&#x6982;&#x7387;&#x66F4;&#x5927;&#xFF0C;&#x90A3;&#x4E48;&#x8BBE;&#x8BA1;&#x5B9E;&#x9A8C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x628A;&#x6982;&#x7387;&#x5927;&#x7684;&#x7EC4;&#x5408;&#x5148;&#x8DD1;&#x4E0A;&#x3002;&#x5982;&#x679C;&#x6070;&#x5982;&#x9884;&#x671F;&#x7684;&#x8FD9;&#x6837;&#xFF0C;&#x5C31;&#x7C7B;&#x4F3C;&#x4E8E;&#x6D41;&#x6C34;&#x7EBF;&#x5904;&#x7406;&#x4E2D;&#x7684; hit &#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7406;&#x60F3;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5B9E;&#x9645;&#x7684;&#x60C5;&#x51B5;&#x4F1A;&#x6BD4;&#x8FD9;&#x4E2A;&#x66F4;&#x52A0;&#x590D;&#x6742;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x7075;&#x6D3B;&#x5904;&#x7406;&#xFF0C;&#x5E73;&#x8861;&#x8D44;&#x6E90;&#x548C;&#x5B9E;&#x9A8C;&#x5468;&#x671F;&#x4E86;&#x3002;</p>
<h2 id="&#x60C5;&#x7EEA;&#x5F71;&#x54CD;">&#x60C5;&#x7EEA;&#x5F71;&#x54CD;</h2>
<p>&#x4EBA;&#x4E0D;&#x662F;&#x673A;&#x5668;&#xFF0C;&#x4F1A;&#x53D7;&#x5230;&#x60C5;&#x7EEA;&#x5F88;&#x5927;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x8FD9;&#x4E2A;&#x5F71;&#x54CD;&#x751A;&#x81F3;&#x4F1A;&#x5F71;&#x54CD;&#x6211;&#x4EEC;&#x7684;&#x7406;&#x6027;&#x5224;&#x65AD;&#x3002;
&#x4E0D;&#x77E5;&#x9053;&#x5927;&#x5BB6;&#x6709;&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x611F;&#x53D7;&#xFF0C;&#x6BD4;&#x5982;&#x5F53;&#x6211;&#x4EEC;&#x5BF9;&#x5B9E;&#x9A8C;&#x4E0D;&#x597D;&#x7684;&#x7ED3;&#x679C;&#x5F88;&#x6D88;&#x6781;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x201C;&#x5FC3;&#x6001;&#x5D29;&#x4E86;&#x201D;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x518D;&#x53BB;&#x770B;&#x7ED3;&#x679C;&#xFF0C;&#x8D8A;&#x770B;&#x7ED3;&#x679C;&#x8D8A;&#x5DEE;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x770B;&#x4E3B;&#x89C2;&#x7ED3;&#x679C;&#x7684;&#x65F6;&#x5019;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x8BB0;&#x5FC6;&#x5C31;&#x53EA;&#x8BB0;&#x4F4F;&#x90A3;&#x4E9B;&#x4E0D;&#x597D;&#x7684;&#x65B9;&#x9762;&#xFF0C;&#x597D;&#x7684;&#x65B9;&#x9762;&#x88AB;&#x6F5C;&#x610F;&#x8BC6;&#x5FFD;&#x7565;&#x4E86;&#xFF0C;&#x8FDB;&#x800C;&#x5F97;&#x51FA;&#x5F88;&#x4E0D;&#x5BA2;&#x89C2;&#x7684;&#x7ED3;&#x8BBA;&#x3002;</p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x60C5;&#x7EEA;&#x4E0D;&#x597D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x5E38;&#x5E38;&#x4F1A;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#x5728;&#x7535;&#x8111;&#x524D;&#xFF0C;&#x770B;&#x4F3C;&#x5728;&#x5206;&#x6790;&#x7ED3;&#x679C;&#xFF0C;&#x4F46;&#x731B;&#x5730;&#x4E00;&#x56DE;&#x5934;&#xFF0C;&#x4F1A;&#x610F;&#x8BC6;&#x5230;&#x8FD9;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x5565;&#x8FDB;&#x5C55;&#x4E5F;&#x6CA1;&#x6709;&#x3002;&#x6211;&#x81EA;&#x5DF1;&#x4F1A;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x611F;&#x53D7;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x88AB;&#x60C5;&#x7EEA;&#x652F;&#x914D;&#x4E86;&#x3002;</p>
<p>&#x90A3;&#x5F53;&#x9047;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x81EA;&#x5DF1;&#x610F;&#x8BC6;&#x5230;&#x81EA;&#x5DF1;&#x662F;&#x88AB;&#x60C5;&#x7EEA;&#x5F71;&#x54CD;&#x4E86;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#xFF0C;&#x518D;&#x5728;&#x5EA7;&#x4F4D;&#x4E0A;&#x770B;&#x7740;&#x7535;&#x8111;&#x5DF2;&#x7136;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x610F;&#x4E49;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x5982;&#x5230;&#x6237;&#x5916;&#x8D70;&#x8D70;&#xFF0C;&#x5439;&#x5439;&#x98CE;&#xFF0C;&#x8C03;&#x6574;&#x4E00;&#x4E0B;&#xFF0C;&#x6E05;&#x9192;&#x4E00;&#x4E0B;&#x3002;&#x7136;&#x540E;&#x518D;&#x56DE;&#x6765;&#x5904;&#x7406;&#xFF0C;&#x53CD;&#x800C;&#x662F;&#x66F4;&#x52A0;&#x6709;&#x6548;&#x7387;&#x7684;&#x3002;&#x5F80;&#x5F80;&#x8FD9;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x88AB;&#x56F0;&#x5728;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#x6216;&#x8005;&#x60C5;&#x7EEA;&#x91CC;&#x9762;&#xFF0C;&#x53CD;&#x800C;&#x601D;&#x8DEF;&#x80FD;&#x591F;&#x66F4;&#x52A0;&#x5F00;&#x9614;&#x3002;</p>
<h2 id="&#x5148;&#x8FDB;&#x53BB;">&#x5148;&#x8FDB;&#x53BB;</h2>
<p>&#x6211;&#x4EEC;&#x4E5F;&#x4F1A;&#x9047;&#x5230;&#x4E0D;&#x60F3;&#x201C;&#x78B0;&#x201D;&#x7684;&#x72B6;&#x51B5;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x662F;&#x7531;&#x4E8E;&#x8981;&#x505A;&#x7684;&#x4E1C;&#x897F;&#x592A;&#x590D;&#x6742;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x56E0;&#x4E3A;&#x5C31;&#x662F;&#x83AB;&#x540D;&#x7684;&#x60C5;&#x7EEA;&#x62B5;&#x89E6;&#x3002;
&#x8FD9;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x7ECF;&#x9A8C;&#x662F; &#x5148;&#x4E0D;&#x7BA1;&#x90A3;&#x4E48;&#x591A;&#xFF0C;&#x5148;&#x201C;&#x65E0;&#x8111;&#x201D;&#xFF08;&#x6216;&#x8005;&#x786C;&#x7740;&#x5934;&#x76AE;&#xFF09;&#x5730;&#x8FDB;&#x53BB;&#x518D;&#x8BF4;&#x3002;&#x5F80;&#x5F80;&#x4E00;&#x65E6;&#x9759;&#x4E0B;&#x5FC3;&#x6765;&#x53BB;&#x505A;&#x4E86;&#xFF0C;&#x53D1;&#x73B0;&#x4E0D;&#x50CF;&#x81EA;&#x5DF1;&#x60F3;&#x7684;&#x90A3;&#x6837;&#x7684;&#xFF0C;&#x62B5;&#x89E6;&#x7684;&#x60C5;&#x7EEA;&#x4FBF;&#x4E5F;&#x6D88;&#x9664;&#x4E86;&#x5927;&#x534A;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8981;&#x505A;&#x7684;&#x4E1C;&#x897F;&#x590D;&#x6742;&#xFF0C;&#x53EF;&#x4EE5;&#x6162;&#x6162;&#x5148;&#x62C6;&#x89E3;&#x4E00;&#x4E0B;&#xFF0C;&#x6216;&#x8005;&#x5C31;&#x5148;&#x505A;&#x4E00;&#x4E0B;&#x5B83;&#x5916;&#x56F4;&#x7684;&#x6742;&#x4E8B;&#xFF0C;&#x505A;&#x7740;&#x505A;&#x7740;&#x4FBF;&#x4F1A;&#x6478;&#x5230;&#x601D;&#x8DEF;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x201C;&#x8BEF;&#x5224;&#x201D;&#xFF0C;&#x800C;&#x8FD9;&#x79CD;&#x8BEF;&#x5224;&#x4E5F;&#x662F;&#x7531;&#x4E8E;&#x88AB;&#x60C5;&#x7EEA;&#x3001;&#x611F;&#x53D7;&#x5F71;&#x54CD;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x5462;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x8981;&#x5C1D;&#x8BD5;&#x53CD;&#x89C2;&#x4E00;&#x4E0B;&#xFF0C;&#x54EA;&#x4E9B;&#x662F;&#x60C5;&#x7EEA;&#x3001;&#x611F;&#x53D7;&#x7684;&#x56E0;&#x7D20;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x5B83;&#x4EEC;&#x4E0D;&#x89C1;&#x5F97;&#x662F;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x800C;&#x662F;&#x88AB;&#x5916;&#x754C;&#x5F71;&#x54CD;&#x7684;&#x3002;</p>
<h2 id="&#x8D4C;&#x5F92;&#x5FC3;&#x6001;">&#x8D4C;&#x5F92;&#x5FC3;&#x6001;</h2>
<p>&#x8D4C;&#x5F92;&#x5FC3;&#x6001;&#xFF0C;&#x8FD9;&#x4E2A;&#x5728;&#x6982;&#x8FF0;&#x91CC;&#x9762;&#x6709;&#x63D0;&#x8FC7;&#x3002;
&#x6709;&#x65F6;&#x5019;&#x5C31;&#x60F3;&#x5C1D;&#x8BD5;&#x4E00;&#x628A;&#xFF0C;&#x8BD5;&#x4E86;&#x7ED3;&#x679C;&#x4E0D;&#x597D;&#xFF0C;&#x5C31;&#x653E;&#x5F03;&#x4E86;&#xFF0C;&#x5C31;&#x8F6C;&#x800C;&#x5BFB;&#x627E;&#x4E0B;&#x4E00;&#x4E2A;&#x201C;&#x673A;&#x4F1A;&#x201D;&#x3002;
&#x8FD9;&#x6837;&#x7684;&#x8D4C;&#x5F92;&#x5FC3;&#x6001;&#xFF0C;&#x53EA;&#x9002;&#x5408;&#x6458;&#x53D6;&#x201C;low hanging fruit&#x201D;&#xFF0C;&#x90A3;&#x73B0;&#x5728;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x53D1;&#x5C55;&#x5F97;&#x90A3;&#x4E48;&#x4E45;&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x7684;fruits &#x57FA;&#x672C;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x4E86;&#x3002;
&#x6709;&#x60F3;&#x6CD5;&#x4E86;&#xFF0C;&#x8BD5;&#x4E00;&#x4E0B;&#x662F; OK&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x81F3;&#x5C11;&#x8981;&#x60F3;&#x660E;&#x767D;&#x4E3A;&#x5565;&#x89C9;&#x5F97;&#x5B83;&#x80FD;&#x591F; work (&#x5047;&#x8BBE;)&#xFF0C;&#x9884;&#x671F;&#x662F;&#x600E;&#x4E48;&#x7684;&#x8868;&#x73B0;&#x3002;&#x7136;&#x540E;&#x7ED3;&#x679C;&#x4E0D;&#x597D;&#xFF0C;&#x81F3;&#x5C11;&#x9700;&#x8981;&#x5206;&#x6790;&#x4E00;&#x4E0B;&#xFF0C;&#x8981;&#x7ED9;&#x81EA;&#x5DF1;&#x4FE1;&#x670D;&#x7684;&#x7406;&#x7531;&#xFF0C;&#x8BF4;&#x660E;&#x4E3A;&#x5565;&#x5B83;&#x4E0D;work&#x3002;</p>
<p>&#x53E6;&#x5916;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x8D4C;&#x5F92;&#x5FC3;&#x6001;&#xFF0C;&#x4E0D;&#x662F;&#x5728;&#x60F3;&#x505A;&#x597D;&#x4E00;&#x4EF6;&#x4E8B;&#x672C;&#x8EAB;&#xFF0C;&#x800C;&#x662F;&#x671D;&#x7740;&#x6210;&#x679C;&#x5728;&#x8D70;&#x3002;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x662F; &#x60F3;&#x7740;&#x628A;&#x4E00;&#x4EF6;&#x4E8B;&#x505A;&#x597D;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x4E00;&#x6B65;&#x6B65;&#x8E0F;&#x5B9E;&#x53BB;&#x505A;&#xFF0C;&#x4F1A;&#x4E0D;&#x65AD;&#x5730;&#x53BB;&#x8FED;&#x4EE3;&#x3002;&#x4E5F;&#x4F1A;&#x81EA;&#x7136;&#x5730;&#x5173;&#x6CE8;&#x5230;&#x505A;&#x597D;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#x7684;&#x65B9;&#x65B9;&#x9762;&#x9762;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x6709;&#x4E0D;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x4E0D;&#x5BF9;&#x7684;&#x5730;&#x65B9;&#x4FBF;&#x4F1A;&#x53BB;&#x6539;&#x8FDB;&#x3002;&#x5F53;&#x628A;&#x8FD9;&#x4E9B;&#x7EC6;&#x8282;&#x90FD;&#x505A;&#x597D;&#x4E86;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x201C;&#x4F60;&#x8981;&#x8D4C;&#x201D;&#x7684;&#x90A3;&#x4E2A;&#x4E1C;&#x897F;&#x624D;&#x53EF;&#x80FD;&#x88AB;&#x641E;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x5C31;&#x50CF;&#x7A81;&#x7834;&#x6211;&#x4EEC;&#x60F3;&#x6CD5;&#x7684;&#x65B0;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x6BD4;&#x5982;&#x6700;&#x8FD1;&#x7684; Vision Transformer, MLP-Mixer&#x8FD9;&#x4E9B;&#xFF0C;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x8D4C;&#x5F92;&#x5FC3;&#x6001;&#x641E;&#x51FA;&#x6765;&#x7684;&#x3002;&#x5B83;&#x4EEC;&#x90A3;&#x4E48;&#x96BE;&#x8C03;&#xFF0C;&#x90FD;&#x80FD;&#x591F;&#x88AB;&#x8C03;&#x51FA;&#x6765;&#x3002;&#x8981;&#x662F;&#x8D4C;&#x5F92;&#x5FC3;&#x6001;&#x7684;&#x8BDD;&#xFF0C;&#x641E;&#x4E00;&#x628A;&#xFF0C;&#xFF08;&#x80AF;&#x5B9A;&#x4E0D;work&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x653E;&#x5F03;&#x4E86;=-= &#x90A3;&#x4E48;&#xFF0C;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x63A8;&#x52A8;&#x7740;&#x4ED6;&#x4EEC;&#x80FD;&#x591F;&#x505A;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x5DE5;&#x4F5C;&#x5462;&#xFF1F;&#x2014;&#x2014; &#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x4E2A; &#x201C;&#x5B83;&#x4E00;&#x5B9A;&#x4F1A; work&#x201D; &#x7684;&#x4FE1;&#x5FF5;&#x3002;&#x8FD9;&#x79CD;&#x4FE1;&#x5FF5;&#x53EF;&#x80FD;&#x6765;&#x81EA;&#x4E8E;&#x4ED6;&#x4EEC;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x5BF9;&#x5DF2;&#x6709;&#x5DE5;&#x4F5C;&#x7684;&#x89C2;&#x5BDF;&#x7B49;&#x7B49;&#x3002;&#xFF08;&#x6211;&#x4E5F;&#x5F88;&#x597D;&#x5947;&#x4ED6;&#x4EEC;&#x7684;&#x7814;&#x7A76;&#x8FC7;&#x7A0B;&#xFF0C;&#x5E0C;&#x671B;&#x4ED6;&#x4EEC;&#x80FD;&#x591F;&#x5199;&#x4E00;&#x4E2A;&#x7ECF;&#x9A8C;&#x5206;&#x4EAB;&#x5E16;&#x5B50; :-)&#xFF09;</p>
<h2 id="&#x575A;&#x6301;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;">&#x575A;&#x6301;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;</h2>
<p>&#x6211;&#x4EEC;&#x5904;&#x5728;&#x4E00;&#x4E2A;&#x8F83;&#x597D;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x7B97;&#x662F;&#x5386;&#x53F2;&#x7684;&#x5927;&#x52BF;&#x4E86;&#x3002;
&#x90A3;&#x53EA;&#x8981;&#x575A;&#x6301;&#x505A;&#xFF0C;&#x603B;&#x4F1A;&#x6709;&#x6210;&#x7EE9;&#x3002;&#x6240;&#x8C13;&#x201C;&#x79EF;&#x8DEC;&#x6B65;&#xFF0C;&#x81F3;&#x5343;&#x91CC;&#x201D;&#xFF0C;&#x6240;&#x8C13;&#x201C;&#x4E45;&#x4E45;&#x4E3A;&#x529F;&#x201D;&#x3002;</p>
<p>&#x4E4B;&#x524D;&#x770B;&#x8FC7;&#x6234;&#x5EFA;&#x4E1A;&#x8001;&#x5E08;&#x60BC;&#x5FF5;&#x8881;&#x9686;&#x5E73;&#x9662;&#x58EB;&#x7684;&#x89C6;&#x9891;<a href="https://www.bilibili.com/video/BV1ov411G7He" target="_blank">&#x300A;&#x60BC;&#x5FF5;&#x8881;&#x9686;&#x5E73;&#x9662;&#x58EB;&#x6700;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5411;&#x4ED6;&#x5B66;&#x4E60;&#xFF01;&#x300B;</a>&#x3002;&#x89C6;&#x9891;&#x91CC;&#x9762;&#x63D0;&#x5230;&#x4E86;&#x6234;&#x5EFA;&#x4E1A;&#x8001;&#x5E08;&#x4ECE;&#x8881;&#x8001;&#x8EAB;&#x4E0A;&#x5B66;&#x5230;&#x7684;&#xFF1A;&#x6211;&#x4EEC;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x4EBA;&#xFF0C;&#x628A;&#x5168;&#x90E8;&#x7684;&#x7CBE;&#x529B;&#x96C6;&#x4E2D;&#x5728;&#x5E72;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x5B9A;&#x4F1A;&#x628A;&#x4E00;&#x4EF6;&#x4E8B;&#x5E72;&#x597D;&#x3002;&#x6BD4;&#x5982;&#x8881;&#x8001;&#x5C31;&#x4E00;&#x76F4;&#x7814;&#x7A76;&#x6C34;&#x7A3B;&#xFF0C;&#x6234;&#x8001;&#x5E08;&#x4E00;&#x76F4;&#x7814;&#x7A76;&#x8BD7;&#x8BCD;&#x3002;&#x8FD9;&#x79CD;&#x7CBE;&#x795E;&#x548C;&#x505A;&#x6CD5;&#x6211;&#x89C9;&#x5F97;&#x662F;&#x503C;&#x5F97;&#x6DF1;&#x601D;&#x548C;&#x5B66;&#x4E60;&#x7684;&#x3002;
&#x4E5F;&#x63A8;&#x8350;&#x5927;&#x5BB6;&#x770B;&#x770B;~</p>
<iframe src="//player.bilibili.com/player.html?aid=248310340&amp;bvid=BV1ov411G7He&amp;cid=344025227&amp;page=1" scrolling="no" border="0" frameborder="no" framespacing="0" allowfullscreen="true"> </iframe>

<p><a href="https://www.bilibili.com/video/BV1ov411G7He" target="_blank">https://www.bilibili.com/video/BV1ov411G7He</a> </p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; Xintao all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x4FEE;&#x6539;&#x65F6;&#x95F4;: 
2021-11-01 02:21:18
</span></footer>
                        
                    </section>
                    
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                </div>
            </div>
            
        </div>

        
        
        <a href="01-概述与三个基本观念.html"
            class="navigation navigation-prev "
            aria-label="Previous page: 01-概述与三个基本观念">
            <i class="fa fa-angle-left"></i>
        </a>
        
        
        <a href="03-开发流程.html"
            class="navigation navigation-next "
            aria-label="Next page: 03-开发流程">
            <i class="fa fa-angle-right"></i>
        </a>
        
        
        
    </div>
    <script>
        var gitbook = gitbook || [];
        gitbook.push(function () {
            gitbook.page.hasChanged({"page":{"title":"02-朴素的总结","level":"1.3.2","depth":2,"next":{"title":"03-开发流程","level":"1.3.3","depth":2,"path":"流程规范与经验/03-开发流程.md","ref":"流程规范与经验/03-开发流程.md","articles":[]},"previous":{"title":"01-概述与三个基本观念","level":"1.3.1","depth":2,"path":"流程规范与经验/01-概述与三个基本观念.md","ref":"流程规范与经验/01-概述与三个基本观念.md","articles":[]},"dir":"ltr"},"config":{"plugins":["theme-coolx@git+https://github.com/xinntao/gitbook-plugin-theme-coolx","-sharing","-lunr","-search","-highlight","expandable-chapters","chapter-fold","tbfed-pagefooter","search-plus","katex","emphasize","prism","todo","editlink","flexible-alerts","click-reveal@git+https://github.com/xinntao/gitbook-plugin-click-reveal"],"ignores":["node_modules","_book"],"root":".","styles":{"website":"styles/website.css","ebook":"styles/website.css","pdf":"styles/website.css","mobi":"styles/website.css","epub":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy Xintao","modify_label":"修改时间: ","modify_format":"YYYY-MM-DD HH:mm:ss"},"chapter-fold":{},"prism":{"css":["gitbook-plugin-theme-coolx/_themes/prism-shades-of-purple.css"]},"emphasize":{},"editlink":{"label":"Edit This Page","multilingual":false,"base":"https://github.com/xinntao/records/blob/master/"},"todo":{},"theme-coolx":{"copyButtons":true,"copyLines":true,"dragSplitter":true,"favicon":"favicon.png","logo":"logo.png","search-placeholder":"输入关键字搜索","hide-elements":[".summary .gitbook-link"]},"katex":{},"fontsettings":{"theme":"white","family":"sans","size":2},"click-reveal":{},"flexible-alerts":{"danger":{"className":"danger","icon":"fa fa-ban","label":"Attention"},"note":{"className":"info","icon":"fa fa-info-circle","label":"Note"},"style":"flat","tip":{"className":"tip","icon":"fa fa-lightbulb-o","label":"Tip"},"warning":{"className":"warning","icon":"fa fa-exclamation-triangle","label":"Warning"},"comment":{"label":"Comment","icon":"fa fa-comments","className":"info"}},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"expandable-chapters":{},"search-plus":{}},"theme":"default","author":"Xintao","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"themeCoolX":{"nav":[{"url":"https://xinntao.github.io/","target":"_blank","name":"Home (host on github)"},{"url":"https://xinntao.gitee.io/","target":"_blank","name":"Home (host on gitee)"},{"url":"https://github.com/xinntao/records","target":"_blank","name":"GitHub"},{"url":"https://gitee.com/xinntao/records","target":"_blank","name":"Gitee码云"}]}},"title":"记录","language":"zh-hans","links":{"sidebar":{}},"gitbook":"3.2.3","description":"记录"},"file":{"path":"流程规范与经验/02-朴素的总结.md","mtime":"2021-10-31T18:21:18.613Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-10-31T18:35:18.283Z"},"basePath":"..","book":{"language":""}})
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-flexible-alerts/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-click-reveal/click_reveal.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-theme-coolx/theme.js"></script>
        
    

    </body>
</html>

